{    "limbs": [        {            "id": 2048838844,            "type": "node",            "label": "New",            "url": "new",            "description": "New in Limber v2! All sorts in here",            "limbs": [                {                    "id": 2048840415,                    "type": "limb",                    "label": "Airgela",                    "url": "Airgela.json",                    "img": "Airgela.png",                    "description": "Loosely based on a popular social network’s illustration system.\r\rIf you need the outline to continue all the way around, change Stroke 2 inside Bottom Fill to Round Cap and drag the End Cap and Start Cap Groups above the Bottom Fill"                },                {                    "id": 2048839421,                    "type": "limb",                    "label": "Bell End",                    "url": "BellEnd.json",                    "img": "BellEnd.png",                    "description": "A perfectly imperfect MIckey Mouse leg with lots of customization options. Check out Tubuloso, Spongebob and Nothing Up My Sleeve for similar vibes."                },                {                    "id": 2048840187,                    "type": "limb",                    "label": "Bluey",                    "url": "Bluey.json",                    "img": "Bluey.png",                    "description": "Deceptively simple. If you need a curvy limb with a color split on both the fill color AND the outline, this is probably your ticket. You can taper this limb in one direction."                },                {                    "id": 2048839837,                    "type": "limb",                    "label": "Finns Arm",                    "url": "FinnsArm.json",                    "img": "FinnsArm.png",                    "description": "One color split. Tapering in one direction. Outlines. Open butt caps.\rSimple, fast and robust. "                },                {                    "id": 2048839868,                    "type": "limb",                    "label": "Finns Leg",                    "url": "FinnsLeg.json",                    "img": "FinnsLeg.png",                    "description": "Similar to Finns Arm but with the option of a different width for the lower section to the upper. This one has tapering on that lower section only, but it can run in both directions."                },                {                    "id": 2048839470,                    "type": "limb",                    "label": "Hose Stack",                    "url": "HoseStack.json",                    "img": "HoseStack.png",                    "description": "This has four ‘layers’. The bottom one acts like a kind of base which is always full length. The three topmost ones all have controls for their Trim Paths Start and End, Stroke Width, and Color. Their strokes are Butt Cap unless you set the Trim to 0 or 100, when they’ll gain a circle at the end, like the red one has here."                },                {                    "id": 2048839853,                    "type": "limb",                    "label": "Mordecai",                    "url": "Mordecai.json",                    "img": "Mordecai.png",                    "description": "It’s weirdly tricky to do an outlined band on a tapering, curvy limb like this.\r\rYou can reduce the taper to zero, but you can’t taper it in the opposite direction. You can slide the band along the limb, but it works best on straight sections. The band has faux-3D rounding. The shoulder outline can be trimmed around the circle."                },                {                    "id": 2048838826,                    "type": "limb",                    "label": "Nothing Up My Sleeve",                    "url": "NothingUpMySleeve.json",                    "img": "NothingUpMySleeve.png",                    "description": "You can change the cuff length, and where it is along the limb. The cuff has faux-3D rounding."                },                {                    "id": 2048839944,                    "type": "limb",                    "label": "Omnidroid",                    "url": "Omnidroid.json",                    "img": "Omnidroid.png",                    "description": "This one easily could be customized for a stripy breton sleeve. Or try turning off the bottommost Stroke for a slightly different mechanical style. The subdivision lines are built from a dashed stroke, so they’re nice and fast. But, unlike in Rigby these ones are adaptive and stay at a constant (user controlled) total as the limb’s length changes."                },                {                    "id": 2048839151,                    "type": "limb",                    "label": "Parallel Lines",                    "url": "ParallelLines.json",                    "img": "ParallelLines.png",                    "description": "If your design requires an outlined limb with open caps AND transparency in the middle, this is probably what you want. It’s fast and reliable, and the outline can either scale along with the character, or stay at constant stroke width.\r\rThis relies on Offset Paths, which mean it can’t taper - have a look at Jims Arm if you need that."                },                {                    "id": 2048839556,                    "type": "limb",                    "label": "Pathwarper",                    "url": "Pathwarper.json",                    "img": "Pathwarper.png",                    "description": "Ok, this might look like a kid’s tv show from the 1980’s, and there’s no shame in that. But this limb can warp ANY path along itself. Yes, warp. Almost like the puppet tool, but this is all 100% vector. Edit the path inside the Reference Shape Group and you’ll see what I mean.\r\rThe drawback? It’s slow. Try to keep the number of points in the shape as low as possible, and that’ll help it speed up a bit. "                },                {                    "id": 2048838788,                    "type": "limb",                    "label": "Pinstripe",                    "url": "Pinstripe.json",                    "img": "Pinstripe.png",                    "description": "This is Curved Bezier Taper with an added pinstripe that can be shifted from one side of the limb to the other. Add some dashes to it’s stroke and you’ve got stitching. A related limb is Offset Path, but this one should run a little faster. "                },                {                    "id": 2048839135,                    "type": "limb",                    "label": "Quadcolor",                    "url": "Quadcolor.json",                    "img": "Quadcolor.png",                    "description": "Four colors, each with it’s own trim length. Round Caps at the start and Butt Caps at the other end. Tapering is proportional for all four colors - via an Upper Width and a Lower Width property rather than just a taper amount. So if you need the end to be a precise pixel size, it’s straightforward."                },                {                    "id": 2048839905,                    "type": "limb",                    "label": "Rigby",                    "url": "Rigby.json",                    "img": "Rigby.png",                    "description": "The ‘hairs’ look slightly hand-drawn due to a Wiggle Paths and a Wave on the Stroke. Turn those off and it‘ll become more regular.\r\rYou’ll get more dashes as the limb gets longer. If you want the number of dashes to stay constant, check out Omnidroid. "                },                {                    "id": 2048840335,                    "type": "limb",                    "label": "SpongeBob",                    "url": "SpongeBob.json",                    "img": "SpongeBob.png",                    "description": "Similar to ‘Bell End’ but without the outline on the sleeve."                },                {                    "id": 2048839402,                    "type": "limb",                    "label": "Steamboat Willie",                    "url": "SteamboatWillie.json",                    "img": "SteamboatWillie.png",                    "description": "Taken out of context like, this looks a bit cylindrical. But add a character’s body and feet, with some effects to roughen everything up, this does a pretty good impression of 1920’s rubberhose animation."                },                {                    "id": 2048839962,                    "type": "limb",                    "label": "T Rex",                    "url": "TRex.json",                    "img": "TRex.png",                    "description": "The dots are a dashed stroke, but an expression on the Gap size keeps them ‘stuck’ to the limb sections as they change length. Play with the Trim Path properties to control where the dots start and stop.  "                },                {                    "id": 2048839385,                    "type": "limb",                    "label": "The Animade",                    "url": "TheAnimade.json",                    "img": "TheAnimade.png",                    "description": "The only limb in the library that’s so simple it doesn’t have any controls at all. The unique curvature style comes from using Round Corners with an adaptive Radius.\r\rAw. So cute. "                },                {                    "id": 95,                    "type": "limb",                    "label": "The Boiler",                    "url": "TheBoiler.json",                    "img": "TheBoiler.png",                    "description": "This is a simple Path limb with an integrated, vector ‘line boil’ that simulates a hand drawn look.\r\rThe FPS setting determines how often the boil changes, and is relative to the comp’s frame rate. So if your comp is 24fps and you want to animate on 2’s - set it to 12, or to animate on 3’s set it to 8. Turn on Motion Sensing and the boil will only trigger when the limb is moving."                },                {                    "id": 2048840005,                    "type": "limb",                    "label": "The Claw",                    "url": "TheClaw.json",                    "img": "TheClaw.png",                    "description": "There are so many different design elements you could incorporate into a 2d robotic arm.  As it stands this is pretty simple, but you could easily add touches to the different parts, and make it into something more unique."                },                {                    "id": 2048839245,                    "type": "limb",                    "label": "The Torrence",                    "url": "TheTorrence.json",                    "img": "TheTorrence.png",                    "description": "This is similar to Faux 3D Sleeve but with an outline. "                },                {                    "id": 2048839768,                    "type": "limb",                    "label": "Thick Line",                    "url": "ThickLine.json",                    "img": "ThickLine.png",                    "description": "Inspired by UPA and 60’s Hanna-Barbera, this one keeps things pretty simple. You can adjust the taper on the outline, and in both directions on the limb itself."                },                {                    "id": 2048839669,                    "type": "limb",                    "label": "Thick Line Alternate",                    "url": "ThickLineAlternate.json",                    "img": "ThickLineAlternate.png",                    "description": "This has the same aim as Thick Line, but goes about it with more user control.\r\rHere you’ve got three Widths to play with, as well as separate Curvature controls for each side. So if you put in a bit more time and keyframe the shape as it animates, you can get more distinctive results."                },                {                    "id": 2048839807,                    "type": "limb",                    "label": "Thin Line",                    "url": "ThinLine.json",                    "img": "ThinLine.png",                    "description": "This might be the perfect open-ended, minimal outlined limb. You can taper this in either direction (or both at once) and that’s about it.\r\rBecause it’s simple, it’s fast."                },                {                    "id": 2048839731,                    "type": "limb",                    "label": "Thin Line Highlight",                    "url": "ThinLineHighlight.json",                    "img": "ThinLineHighlight.png",                    "description": "The highlight has an Angle Follows Limb setting which overrides the Highlight Angle.\r\rApart from the highlight this is identical to Thin Line."                },                {                    "id": 2048839929,                    "type": "limb",                    "label": "Topo",                    "url": "Topo.json",                    "img": "Topo.png",                    "description": "You could re-purpose this for anything that needs studs, suckers, nodules, lumps or hairs.\r\rIt uses an expression to draw a second bezier path that follows the main path, jutting out at either side. We’ve included controls for Random Distribution and Random Length.\r\rPreview speed will increase as you lower the number of suckers."                },                {                    "id": 2048839540,                    "type": "limb",                    "label": "Tubuloso",                    "url": "Tubuloso.json",                    "img": "Tubuloso.png",                    "description": "This one’s so much fun to animate with. Similar to Nothing Up My Sleeve, but here the cuff is more organic and cartoony feeling, and the way it looks when the rounding flips from side to side is pretty special."                },                {                    "id": 1068,                    "type": "limb",                    "label": "Woodcutter",                    "url": "Woodcutter.json",                    "img": "Woodcutter.png",                    "description": "2015 called and it wants it’s character design back.\r\rSeriously though, the pay-off for the simplicity of this is it’s speed. If we include something like faux-3D Rounding in a limb, it’ll inevitably slow it down, even if it’s set to zero."                },                {                    "id": 1087,                    "type": "limb",                    "label": "Wrangler",                    "url": "Wrangler.json",                    "img": "Wrangler.png",                    "description": "A basic tapered path with two extra strokes that you can use for stitching or a seam or crease.\r\rThis is another one where the dashed stroke stretches automatically to maintain a constant number of dashes. Here, you can just go into the limb and set the dash value manually. The gaps will be the same length. "                }            ]        },        {            "id": 2048837809,            "type": "node",            "label": "Path Based",            "url": "path_based",            "description": "Variations on the default Path limb",            "limbs": [                {                    "id": 2048837810,                    "type": "limb",                    "label": "3 Part Path with Foot",                    "url": "3PartPathwithFoot.json",                    "img": "3PartPathwithFoot.png",                    "description": "This is the same as Path with Foot except that the three sections of the limb are all separate paths, so you can style them independently.\r\rAttributes like color and stroke can be altered manually in the layer. The Stroke Widths do have an expression so they work with Limber’s scaling, but you can still edit the values.\r\rIf you don’t want the foot, just delete the Foot Group from the limb layer."                },                {                    "id": 2048837927,                    "type": "limb",                    "label": "Colored Path",                    "url": "ColoredPath.json",                    "img": "ColoredPath.png",                    "description": "This limb replicates the Color, Split and Rounding controls of a Taper, in a Path limb. You can still use Curvature to round out the joint, and everything is based on stroked paths instead of filled beziers.\r\rThere’s no tapering with this, which helps keep it a bit faster. Check out Tapered Path, if you want that."                },                {                    "id": 2048833911,                    "type": "limb",                    "label": "Faux 3D Path",                    "url": "Faux3DPath.json",                    "img": "Faux3DPath.png",                    "description": "Here you’ve got two Width controls, a Split anywhere along the path, and faux-3D Rounding for the split with a filled, extruded kind of look. Faux 3D Sleeve is the same thing but open-looking.\r\rBoth of these limbs limit the Lower Width so it cannot be wider than the Upper Width."                },                {                    "id": 2048837962,                    "type": "limb",                    "label": "Faux 3D Sleeve",                    "url": "Faux3DSleeve.json",                    "img": "Faux3DSleeve.png",                    "description": "This is based on Faux 3D Path, but has an open appearance to the sleeve end."                },                {                    "id": 2048837982,                    "type": "limb",                    "label": "Offset Path",                    "url": "OffsetPath.json",                    "img": "OffsetPath.png",                    "description": "This limb is designed for cases where you want to offset a path on one side only. Pinstripe is a similar alternative. \r\rThere are controls for the amount of offset and subdivision (smoothness) of the path. It gets slower as you increase the subdivision.  If that’s an issue, you could keep it low and then turn up the subdivision when you render.\r\rIf you don’t want bendiness, set Curvature to 0.1 and reduce the Offset Path Subdivision to 2."                },                {                    "id": 2048837998,                    "type": "limb",                    "label": "Outlined Path",                    "url": "OutlinedPath.json",                    "img": "OutlinedPath.png",                    "description": "This limb provides three, separate outlined strokes, with width, color and split controls. The outline is a constant stroke width, even when you scale up the limb.\r\rThis limb mostly only works as expected when the Sizes are smaller towards the end."                },                {                    "id": 2048837881,                    "type": "limb",                    "label": "Path for adding strokes",                    "url": "Pathforaddingstrokes.json",                    "img": "Pathforaddingstrokes.png",                    "description": "This limb adds a second stroke which is expression-linked back to the base path so it runs faster than if you just duplicated the base path (and it’s expression).\r\rThat sounds way more complicated than it should do.\r\rIf you want to duplicate a default path limb’s path, eg. so you can use Trim Paths, use this. "                },                {                    "id": 2048837902,                    "type": "limb",                    "label": "Path with End Rounding",                    "url": "PathwithEndRounding.json",                    "img": "PathwithEndRounding.png",                    "description": "This limb adds faux-3D rounding to the start and end caps of the stroke that you can animate for an illusion of depth.\r\rChange the Stroke Color and the caps will automatically change too."                },                {                    "id": 2048837864,                    "type": "limb",                    "label": "Path with Foot",                    "url": "PathwithFoot.json",                    "img": "PathwithFoot.png",                    "description": "This limb adds a fourth point to the end of the path, like a foot, with controls for length, and tangent angles so you can simulate toe and heel roll.\r\r3 Part Path with Foot is the same thing with each segment of the path broken into a separate path and stroke."                },                {                    "id": 2048834622,                    "type": "limb",                    "label": "Tapered Path",                    "url": "TaperedPath.json",                    "img": "TaperedPath.png",                    "description": "This does a fair job of combining the features of a Taper (Colors, Widths, Splits) with a Path limb (Curvature). \r\rIt’s almost the Ultimate Limber Limb©, but…\r\rThe limitation is that it only works when the Sizes are smaller towards the end."                }            ]        },        {            "id": 2048838034,            "type": "node",            "label": "Taper Based",            "url": "taper_based",            "description": "Variations on the default Taper limb",            "limbs": [                {                    "id": 2048838035,                    "type": "limb",                    "label": "Expanded Splits",                    "url": "ExpandedSplits.json",                    "img": "ExpandedSplits.png",                    "description": "This is just like a standard Taper limb but with the addition of Expansion properties for the Upper and Lower sections. You still have Rounding and all the other controls from a Taper. "                },                {                    "id": 2048838051,                    "type": "limb",                    "label": "Foot with Toes",                    "url": "FootwithToes.json",                    "img": "FootwithToes.png",                    "description": "This one takes the Taper ‘connected circles’ approach and applies it to two more sections - for a foot, and it’s toes.\r\rThe foot has Width, Length and Angle controls for both sections."                },                {                    "id": 2048838492,                    "type": "limb",                    "label": "Hand",                    "url": "Hand.json",                    "img": "Hand.png",                    "description": "Alter the shapes inside the Hand Group to suit your needs. This group rotates as if it were parented to a Locator - it will not flip when the Clockwise property goes from positive to negative (try Simple Foot if you need that)."                },                {                    "id": 2048838510,                    "type": "limb",                    "label": "Kurts Elbow Crease",                    "url": "KurtsElbowCrease.json",                    "img": "KurtsElbowCrease.png",                    "description": "This has one Split property, limited to the Upper section. The crease in the elbow is fully automated, with controls over the angles over which it will grow.  "                },                {                    "id": 2048838409,                    "type": "limb",                    "label": "Legacy Taper",                    "url": "LegacyTaper.json",                    "img": "LegacyTaper.png",                    "description": "This is how tapers were built way back in Limber v1.5 or so. You have a bunch of Ellipses with wedge shapes in between them that respond to their sizes.\r\rWhy is this here? One thing you can do with this is to disable the expressions on the circles and size them manually - you won’t break things. And then you can make cuffs and sleeves that are wider than the rest of the limb.\r\rYou’re probably better off with Lower Sleeve (Pant) or Upper Sleeve (T shirt). But there are some old tutorials out there that use this limb."                },                {                    "id": 2048838567,                    "type": "limb",                    "label": "Lower Sleeve (Pant)",                    "url": "LowerSleevePant.json",                    "img": "LowerSleevePant.png",                    "description": "In Legacy Taper I mentioned how you could make cuffs and sleeves wider. This one does it all for you and simplifies a few things, so it’s faster and easier. If you need the split to be on the Upper section, try Upper Sleeve (T shirt)."                },                {                    "id": 2048838115,                    "type": "limb",                    "label": "Muscles",                    "url": "Muscles.json",                    "img": "Muscles.png",                    "description": "This has two methods for bulging - Leg and Arm. Leg muscles bulge out one side as you see here. Arm muscles bulge out both sides. The Leg muscles have an Offset property so you can kind of shift them from one side to the other."                },                {                    "id": 2048838163,                    "type": "limb",                    "label": "Shorts and socks",                    "url": "Shortsandsocks.json",                    "img": "Shortsandsocks.png",                    "description": "This is like Upper Sleeve (T shirt), but you still have a Split on the Lower section. So I guess it’s either shorts and socks or a T shirt and wristband.\r\rGenerally these ‘sleeve’ tapers with the wider, sticky-out sections don’t have any Rounding. And neither does this one."                },                {                    "id": 2048838603,                    "type": "limb",                    "label": "Simple Foot",                    "url": "SimpleFoot.json",                    "img": "SimpleFoot.png",                    "description": "Like Foot with Toes but without toes."                },                {                    "id": 2048838195,                    "type": "limb",                    "label": "The Boorman",                    "url": "TheBoorman.json",                    "img": "TheBoorman.png",                    "description": "A more advanced version of the Pant limb, with some specific extra features like a pocket and an outline and a ‘Diagonality’ property for the end of the pants.\r\rSometimes a user asks for something, and we make it. This was one of those."                },                {                    "id": 2048838582,                    "type": "limb",                    "label": "Upper Sleeve (T Shirt)",                    "url": "UpperSleeveTShirt.json",                    "img": "UpperSleeveTShirt.png",                    "description": "Default Tapers are great but foks often  want to make cuffs and sleeves wider. This one does that for T-shirts or Shorts. If you need the Split to be on the Lower section, try Lower Sleeve."                }            ]        },        {            "id": 2048838227,            "type": "node",            "label": "Unique",            "url": "unique",            "description": "Mostly a single expression-driven path that draws an entire limb",            "limbs": [                {                    "id": 2048838228,                    "type": "limb",                    "label": "Curved Bezier Taper",                    "url": "CurvedBezierTaper.json",                    "img": "CurvedBezierTaper.png",                    "description": "This is an attempt to add curvature to a Taper-able limb which dates back to before Adobe added Tapers to Strokes. But it’s still got it’s uses.\r\rIt keeps the three Sizes, which allow you to vary the width along the limb in ways that tapered Strokes can’t. With some bezier math we’ve applied tangents to the shape, making it kinda like a Path limb, but you can adjust the Curvature of each side separately. The bad news is: it’s one color only, with no Splits or Rounding."                },                {                    "id": 2048838659,                    "type": "limb",                    "label": "Curved Joint Taper",                    "url": "CurvedJointTaper.json",                    "img": "CurvedJointTaper.png",                    "description": "This has three variable Sizes, like a Taper, but one side is a continuous curve, while the other is a sharp angle. It’ll always be the outside side that curves. Oh and there’s a stroked path underneath all that (the white bit) so you have that option too. Just delete it if you like.\r\rIt’s sort of a cross between Curved Bezier Taper and Square Elbow. "                },                {                    "id": 2048838260,                    "type": "limb",                    "label": "Half Taper",                    "url": "HalfTaper.json",                    "img": "HalfTaper.png",                    "description": "This is intended for use as a matte, so you can get shading on one side of a limb. That works best as an orphan limb layer, combined with another one."                },                {                    "id": 2048838768,                    "type": "limb",                    "label": "Jims Arm",                    "url": "JimsArm.json",                    "img": "JimsArm.png",                    "description": "This is transparent in the middle so the character’s body will show through. You can curve each side independently.\r\rYou can change the path that makes the hand, or add more paths next to it. But keep it’s Group and Stroke - those have expressions to keep them in sync when you change properties like the Outline Width and Color."                },                {                    "id": 2048838676,                    "type": "limb",                    "label": "Round Corners Taper",                    "url": "RoundCornersTaper.json",                    "img": "RoundCornersTaper.png",                    "description": "This is a bit like The Animade, because it uses Round Corners to smooth the shape. But instead of being a simple path, this one is based on Square Elbow, so it has the three Widths of a Taper."                },                {                    "id": 2048838638,                    "type": "limb",                    "label": "Square Elbow",                    "url": "SquareElbow.json",                    "img": "SquareElbow.png",                    "description": "A single bezier path based around the three Sizes of a Taper but without a circular joint. Instead it has a sharp point which will become extremely long and pointy as you close up the limb. So don’t do that.\r\rThe rig adds Ellipses at the start and end so it’s easier to join on to the rest of the character. But you could delete them if you need to."                },                {                    "id": 2048838694,                    "type": "limb",                    "label": "Swept Elbow",                    "url": "SweptElbow.json",                    "img": "SweptElbow.png",                    "description": "Like a lot of the limbs in this Folder, this one has has three Width properties, and one color. You can adjust the Inner and Outer edges independently, from straight lines like Square Elbow to fully curved like Curved Bezier Taper. "                }            ]        }    ]}