{
    "welcome": "The Limb Library is a collection of dynamic Shape Layer limbs that do things that would be impossible with default limbs or art rigging. Limbs are listed alphabetically in the right column. Check one or more tags in the left column to filter them.\r\rNovember 2025: 3-BONE LIMBS ARE LIVE and available here if you are running Limber v2.1 or above - download the FREE upgrade from aescripts.com. If you attempt to download a 3-bone limb in earlier versions of Limber you will see an error message.",
    "limbs": [
        {
            "id": 2048844942,
            "type": "node",
            "label": "A - B",
            "url": "a_-_b",
            "description": "",
            "limbs": [
                {
                    "id": 2048841740,
                    "type": "limb",
                    "label": "Animatability",
                    "url": "Animatability.json",
                    "img": "Animatability.png",
                    "description": "A lot of folks ask us how we rigged this arm from one of our promotional GIFs, because the linework stays constant width even when each section is foreshortened.\r\rThe answer is that we duplicated the ‘Rigged Lower’ and ‘Rigged Upper’ groups, once for each stroke color, and moved the Strokes themselves outside of these groups.\r\rStrokes don’t get that scaling distortion if they’re outside the shape group it’s applied to!",
                    "tags": [
                        "advanced"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048842334,
                    "type": "limb",
                    "label": "Art Cropper",
                    "url": "ArtCropper.json",
                    "img": "ArtCropper.png",
                    "description": "Any artwork you add to this Taper using the ‘Add Art’ button will be automatically cropped to the taper shape. You could even animate the art from side-to-side to simulate a faux-3D rotation. The taper itself has all the usual features apart from Square End.\r\rTo delete the tattoo art that’s here for demo purposes, twirl down the limb layer Contents > Limb > Upper Group > Rigged Upper and delete the named groups you see inside there (and do the same for the Lower Group). So long as you leave the other Groups and Merge Paths, your own artwork should rig as normal and get cropped.",
                    "tags": [
                        "advanced",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838195,
                    "type": "limb",
                    "label": "The Boorman",
                    "url": "TheBoorman.json",
                    "img": "TheBoorman.png",
                    "description": "A more advanced version of the Pant limb, with some specific extra features like a pocket, an outline and a ‘Diagonality’ property for the end of the pants.\r\rSometimes a user asks for something, and we make it. This was one of those.",
                    "tags": [
                        "asymmetrical",
                        "fast",
                        "outline",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048840187,
                    "type": "limb",
                    "label": "Bluey",
                    "url": "Bluey.json",
                    "img": "Bluey.png",
                    "description": "If you need a curvy limb with a color split on both the fill color AND the outline, this is probably your ticket. You can taper this limb in one direction.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841802,
                    "type": "limb",
                    "label": "Bootylicious",
                    "url": "Bootylicious.json",
                    "img": "Bootylicious.png",
                    "description": "You can turn up the opacity of the Fill for this, or use it transparent like it is by default. The ‘boot’ auto-rotates and you also have an angle control to override that. This won’t flip side automatically when Clockwise goes from positive to negative. You can keyframe the angle by 180º instead.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "hand / foot",
                        "hollow",
                        "outline"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839421,
                    "type": "limb",
                    "label": "Bell End",
                    "url": "BellEnd.json",
                    "img": "BellEnd.png",
                    "description": "A perfectly imperfect MIckey Mouse leg with lots of customization options. Check out Tubuloso, Spongebob and Nothing Up My Sleeve for similar vibes.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844924,
                    "type": "limb",
                    "label": "Angled Crease",
                    "url": "AngledCrease.json",
                    "img": "AngledCrease.png",
                    "description": "This is a basic creased Path limb with an outline, like Curvable Crease and Cute Crease. The difference is that in this one the crease always runs at an angle that’s halfway between the upper and lower sections of the limb.\r\rThe crease will switch sides automatically, and it’ll gradually shorten and disappear as the limb straightens. The Crease Falloff control determines the angle in degrees where that starts to happen.",
                    "tags": [
                        "crease",
                        "fast",
                        "outline",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 95,
                    "type": "limb",
                    "label": "The Boiler",
                    "url": "TheBoiler.json",
                    "img": "TheBoiler.png",
                    "description": "This is a simple Path limb with an integrated, vector ‘line boil’ that simulates a hand drawn look.\r\rThe FPS setting determines how often the boil changes, and is relative to the comp’s frame rate. So if your comp is 24fps and you want to animate on 2’s - set it to 12, or to animate on 3’s set it to 8. Turn on Motion Sensing and the boil will only trigger when the limb is moving.",
                    "tags": [
                        "curvature",
                        "fast"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837810,
                    "type": "limb",
                    "label": "3 Part Path with Foot",
                    "url": "3PartPathwithFoot.json",
                    "img": "3PartPathwithFoot.png",
                    "description": "This is the same as Path with Foot except that the three sections of the limb are all separate paths, so you can style them independently.\r\rAttributes like color and stroke can be altered manually in the layer just like a default Path limb.\r\rIf you don’t want the foot, just delete the Foot Group from the limb layer.",
                    "tags": [
                        "curvature",
                        "fast",
                        "hand / foot"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048840415,
                    "type": "limb",
                    "label": "Airgela",
                    "url": "Airgela.json",
                    "img": "Airgela.png",
                    "description": "If you need the outline to continue all the way around, change Stroke 2 inside Bottom Fill to Round Cap and drag the End Cap and Start Cap Groups above the Bottom Fill.\r\rLoosely based on a popular social network’s illustration system.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844303,
                    "type": "limb",
                    "label": "Business Time",
                    "url": "BusinessTime.json",
                    "img": "BusinessTime.png",
                    "description": "This is the fastest way to do stripes running down the limb - using Offset Paths. The compromise is there’s no tapering.\r\rTry turning up the Wave > Amount property in the Stripes Stroke and play with the other Stroke properties for some crazy repeating patterns. ",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "stripe"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839385,
                    "type": "limb",
                    "label": "The Animade",
                    "url": "TheAnimade.json",
                    "img": "TheAnimade.png",
                    "description": "The only limb in the library that’s so simple it doesn’t have any controls at all. The unique curvature style comes from using Round Corners with an adaptive Radius.",
                    "tags": [
                        "curvature",
                        "fast",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852869,
                    "type": "limb",
                    "label": "The Animade 3-bone",
                    "url": "TheAnimade3-bone.json",
                    "img": "TheAnimade3-bone.png",
                    "description": "A 3-bone version of The Animade",
                    "tags": [
                        "curvature",
                        "fast",
                        "unique joint"
                    ],
                    "structure": "3-bone"
                }
            ]
        },
        {
            "id": 2048844943,
            "type": "node",
            "label": "C - D",
            "url": "c_-_d",
            "description": "",
            "limbs": [
                {
                    "id": 2048841952,
                    "type": "limb",
                    "label": "Doyouthinkhesaurus",
                    "url": "Doyouthinkhesaurus.json",
                    "img": "Doyouthinkhesaurus.png",
                    "description": "You can set the width and length of the spikes at either end of the limb and they automatically interpolate between those values.\r\rTo increase the number of spikes, you need to twirl down the layer > Contents > Limb > Spikes, select the topmost group (it’ll be called ‘Spike 05’ when you first download it) and hit Cmd / Ctrl + D to duplicate that group. Delete the topmost group(s) to get less spikes.\r\rXenomorph is a similar limb for user artwork instead of procedural spikes. ",
                    "tags": [
                        "advanced",
                        "asymmetrical",
                        "curvature",
                        "sequential",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838659,
                    "type": "limb",
                    "label": "Curved Joint Taper",
                    "url": "CurvedJointTaper.json",
                    "img": "CurvedJointTaper.png",
                    "description": "This has three variable Sizes, like a Taper, but one side is a continuous curve, while the other is a sharp angle. It’ll always be the outer side that curves. There’s then a stroked path underneath.\r\rIt’s sort of a cross between Curved Bezier Taper and Square Elbow. ",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "fast",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841703,
                    "type": "limb",
                    "label": "Curvable Crease",
                    "url": "CurvableCrease.json",
                    "img": "CurvableCrease.png",
                    "description": "This is a basic Path limb with an added outline and crease at the joint. You can set the crease to overlap either the upper or lower section and it automatically switches sides when the limb changes direction.",
                    "tags": [
                        "cartoon",
                        "crease",
                        "curvature",
                        "outline",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048842697,
                    "type": "limb",
                    "label": "Cute Crease",
                    "url": "CuteCrease.json",
                    "img": "CuteCrease.png",
                    "description": "This is like a cross between Curvable Crease and The Animade. It doesn’t curve like most Path-based limbs, but it has an automated Round Corners operator that makes it less pointy at the joint when you fold it up.\r\rYou can set the crease to overlap either the upper or lower section and it automatically switches sides when the limb changes direction.",
                    "tags": [
                        "cartoon",
                        "crease",
                        "fast",
                        "outline",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048851132,
                    "type": "limb",
                    "label": "Crockett",
                    "url": "Crockett.json",
                    "img": "Crockett.png",
                    "description": "The foot auto-rotates with the leg by default, but you can turn that off and have it stick to an angle (like a ground plane). To make the foot face out the other side, set it’s Length to a negative number. The heel will get very long and pointy if you rotate the foot up a lot.\r\rBootylicious is a similar limb",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "hand / foot",
                        "outline"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841755,
                    "type": "limb",
                    "label": "Cuphead",
                    "url": "Cuphead.json",
                    "img": "Cuphead.png",
                    "description": "Here you have controls for all the colors, the length and width of the leg, pant and sock. The pant and sock have independent controls for faux-3D perspective angle.\r\rYou can safely delete the sock and / or the pant shape groups from this limb and nothing will break.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841855,
                    "type": "limb",
                    "label": "Cuphead Vintage",
                    "url": "CupheadVintage.json",
                    "img": "CupheadVintage.png",
                    "description": "This is just the Cuphead limb with some Wave in the strokes, which would probably work best on 2’s / at 12fps, because it can jump around a bit.\r\rThe effect stack on the limb gives it some texture - but in practice you would probably apply all these to  the character as a whole, once it’s precomped.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048842840,
                    "type": "limb",
                    "label": "Docsplainer",
                    "url": "Docsplainer.json",
                    "img": "Docsplainer.png",
                    "description": "Based on a Taper limb, so you can easily control the profile from start to end, but you can’t make it curve. The split, which has full rounding control, is restricted to the lower section. There are controls so you can easily trim the line across the cuff, or remove it completely.\r\rThis is the sister to Teesplainer which has the split on the upper section.",
                    "tags": [
                        "crease",
                        "outline",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848353,
                    "type": "limb",
                    "label": "Deeky One",
                    "url": "DeekyOne.json",
                    "img": "DeekyOne.png",
                    "description": "Deeky One, Two and Three all use the same idea of a Path limb with one, two or three strokes, each having options for trimming the start and end points, and different shape caps. The outline is consistent across all strokes.\r\rUse whichever one has the number of layers you need.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048850010,
                    "type": "limb",
                    "label": "Colored Path Outline",
                    "url": "ColoredPathOutline.json",
                    "img": "ColoredPathOutline.png",
                    "description": "Like Colored Path, but with an outline :)\r\rTapered Path Outline is very similar if you need it to taper.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "rounding",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848389,
                    "type": "limb",
                    "label": "Deeky Three",
                    "url": "DeekyThree.json",
                    "img": "DeekyThree.png",
                    "description": "Deeky One, Two and Three all use the same idea of a Path limb with one, two or three strokes, each having options for trimming the start and end points, and different shape caps. The outline is consistent across all strokes.\r\rUse whichever one has the number of layers you need.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848370,
                    "type": "limb",
                    "label": "Deeky Two",
                    "url": "DeekyTwo.json",
                    "img": "DeekyTwo.png",
                    "description": "Deeky One, Two and Three all use the same idea of a Path limb with one, two or three strokes, each having options for trimming the start and end points, and different shape caps. The outline is consistent across all strokes.\r\rUse whichever one has the number of layers you need.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837927,
                    "type": "limb",
                    "label": "Colored Path",
                    "url": "ColoredPath.json",
                    "img": "ColoredPath.png",
                    "description": "This limb replicates the Color, Split and Rounding controls of a Taper, in a Path limb. You can still use Curvature to round out the joint, and everything is based on stroked paths instead of filled beziers.\r\rThere’s no tapering with this, which helps keep it a bit faster. Check out Tapered Path, if you want that.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853576,
                    "type": "limb",
                    "label": "Drumstick",
                    "url": "Drumstick.json",
                    "img": "Drumstick.png",
                    "description": "Here the Upper and Middle section are combined, and they get a Stroke, with Taper and Trim controls. And the Middle and Lower sections are combined with their own Stroke. So you have an overlap on the Middle section.\r\rIf you set both Strokes to the same color, you can get a wide-then-thin profile that’s otherwise tricky with Path limbs.\r\rGoblin Mode and Caniformia State are similar limbs.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048838228,
                    "type": "limb",
                    "label": "Curved Bezier Taper",
                    "url": "CurvedBezierTaper.json",
                    "img": "CurvedBezierTaper.png",
                    "description": "This is an attempt to add curvature to a Taper-able limb which dates back to before Adobe added Tapered Strokes. But it’s still got it’s uses.\r\rIt keeps the three Sizes, which allow you to vary the width along the limb in ways that Tapered Strokes sometimes struggle to achieve. You can adjust the Curvature of each side separately.\r\rIt’s one color only, with no Splits or Rounding.\r\rSwept Elbow is a similar limb.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853353,
                    "type": "limb",
                    "label": "Caniformia State",
                    "url": "CaniformiaState.json",
                    "img": "CaniformiaState.png",
                    "description": "This limb is a default 3-bone Path limb with extra controls to independently reduce the length of the four tangents.\r\rThe default setting alters the lower joint to make this silhouette that’s nicely curved without feeling like it’s made of rubber. Other settings could work well for insects.\r\rAll the Stroke properties are left for you to modify in the layer, just like a normal Path limb.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering",
                        "utility"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048840005,
                    "type": "limb",
                    "label": "The Claw",
                    "url": "TheClaw.json",
                    "img": "TheClaw.png",
                    "description": "There are so many different design elements you could incorporate into a 2d robotic arm.  This is pretty simple, but you could easily add touches to the different parts, and make it into something more unique.",
                    "tags": [
                        "curvature",
                        "hand / foot",
                        "outline",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853188,
                    "type": "limb",
                    "label": "Cave Troll",
                    "url": "CaveTroll.json",
                    "img": "CaveTroll.png",
                    "description": "Twirl down the limb layer contents and inside the ‘Shapes’ group, delete or duplicate as many of the topmost groups until you have the number of hairs you want. The limb will get a bit slower as you increase them.\r\rYou have an Offset Rotation property here - so you can easily add secondary animation to the hairs and have them swing like tassels. Or there is a checkbox to make them orient along the limb.",
                    "tags": [
                        "curvature",
                        "sequential"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048841836,
                    "type": "limb",
                    "label": "Davey Jones",
                    "url": "DaveyJones.json",
                    "img": "DaveyJones.png",
                    "description": "Pop this on to FK or FreeK and you’ve got a quick, flexible chain rig that won’t spawn more links when you stretch it longer.\r\rThe holes are actually a fill color, but if you needed them to be transparent you could change them to a saturated green, then pop the Keylight effect on and set it’s Screen Color to the same green.",
                    "tags": [
                        "curvature",
                        "sequential"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853922,
                    "type": "limb",
                    "label": "Dojo",
                    "url": "Dojo.json",
                    "img": "Dojo.png",
                    "description": "A fairly simple 3-bone foot.\r\rTo use these 3-bone limbs tagged with Foot Roll, you’ll need to change the Lower Length on the End Controller to adjust the distance between the ankle and the ball of the toes. Then style the foot how you want it, and set Weight to 100% and Weight Direction to flatten the base of the foot to the ground plane.",
                    "tags": [
                        "fast",
                        "foot roll",
                        "hand / foot",
                        "split",
                        "tapering"
                    ],
                    "structure": "3-bone"
                }
            ]
        },
        {
            "id": 2048842154,
            "type": "node",
            "label": "E - H",
            "url": "e_-_h",
            "description": "",
            "limbs": [
                {
                    "id": 2048838260,
                    "type": "limb",
                    "label": "Half Taper",
                    "url": "HalfTaper.json",
                    "img": "HalfTaper.png",
                    "description": "This is intended for use as a matte, so you can get shading on one side of a Taper or Circles limb. That works best if you use this as an orphan limb layer.",
                    "tags": [
                        "advanced",
                        "asymmetrical",
                        "fast",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841819,
                    "type": "limb",
                    "label": "Fast Offset Path",
                    "url": "FastOffsetPath.json",
                    "img": "FastOffsetPath.png",
                    "description": "This limb provides a much faster offset path than the old version (now called Slow Offset Path).\r\rThis one is slightly less reliable in certain edge situations, but worth including for the speed boost. Offsetting a path on one side only is strangely difficult in After Effects.\r\rHave a look at Pinstripe if you need the base shape to be tapered.",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "stripe"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841722,
                    "type": "limb",
                    "label": "Greaser Creaser",
                    "url": "GreaserCreaser.json",
                    "img": "GreaserCreaser.png",
                    "description": "The sleeve opening has full Faux-3D rounding but it’s limited to the upper section.\r\rThe crease can be on the lower by dragging the Lower Group above the Upper Group inside the limb layer contents.  \r\rNo curvature or tapering on this one.",
                    "tags": [
                        "cartoon",
                        "crease",
                        "fast",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839868,
                    "type": "limb",
                    "label": "Finns Leg",
                    "url": "FinnsLeg.json",
                    "img": "FinnsLeg.png",
                    "description": "Similar to Finns Arm but with the option of a different width for the lower section to the upper. This one has tapering on that lower section only, but it can run in both directions.\r\rThe rounding on the sleeve also only goes ‘over’ the lower part. There are circular caps on both ends which are not visible in the preview image - they can be rounded down to nothing.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839837,
                    "type": "limb",
                    "label": "Finns Arm",
                    "url": "FinnsArm.json",
                    "img": "FinnsArm.png",
                    "description": "One color split. Tapering in one direction only. Outlines. Open butt caps:\r\rSimple, fast and robust. ",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048846399,
                    "type": "limb",
                    "label": "Finger",
                    "url": "Finger.json",
                    "img": "Finger.png",
                    "description": "The extra fingertip section after the end is FK-only, but it can auto-rotate. There is a true 3-bone version of this limb which is better in most situations.\r\rThe creases have controls to determine the angles at which they are max length and zero length, so that they shrink away when the limb is straight.\r\rSee Kurts Elbow Crease and Simple Foot for similar limbs.",
                    "tags": [
                        "crease",
                        "hand / foot",
                        "outline",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852887,
                    "type": "limb",
                    "label": "Finger 3-bone",
                    "url": "Finger3-bone.json",
                    "img": "Finger3-bone.png",
                    "description": "You’ll need to set the Shape property in the Limber effect to ‘C Shape’ to make this look like the preview image, and behave like a finger. You could also use it as a Z Shape for legs with creases - similar to the 2-bone limb Angled Crease. \r\rThe creases have controls to determine the angles at which they are max length and zero length, so that they shrink away when the limb is straight.",
                    "tags": [
                        "crease",
                        "hand / foot",
                        "outline",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048853291,
                    "type": "limb",
                    "label": "Felix",
                    "url": "Felix.json",
                    "img": "Felix.png",
                    "description": "This one uses a Gradient Stroke: you can assign the Start and End points of the Gradient to anywhere on the limb path and it will follow along as the limb moves. The usual restrictions of Gradient Strokes apply and you’ll need to edit the Colors manually.",
                    "tags": [
                        "curvature",
                        "fast",
                        "gradient",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048833911,
                    "type": "limb",
                    "label": "Faux 3D Path",
                    "url": "Faux3DPath.json",
                    "img": "Faux3DPath.png",
                    "description": "Here you’ve got two Width controls, a Split anywhere along the path, and faux-3D Rounding for the split with a filled, extruded look. Faux 3D Sleeve is the same thing but open-looking.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837962,
                    "type": "limb",
                    "label": "Faux 3D Sleeve",
                    "url": "Faux3DSleeve.json",
                    "img": "Faux3DSleeve.png",
                    "description": "This is based on Faux 3D Path, but has an open appearance to the sleeve end.\r\rCheck out The Torrence if you need this limb with an outline.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852392,
                    "type": "limb",
                    "label": "Goblin Mode",
                    "url": "GoblinMode.json",
                    "img": "GoblinMode.png",
                    "description": "This is based on a 3-bone Path limb, with the path split out into three separate paths.\r\rYou can change the Wave frequency to make the sections bulge at the muscles rather than the joints.\r\rMuscles 3-bone is a similar limb.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048853396,
                    "type": "limb",
                    "label": "The Goat",
                    "url": "TheGoat.json",
                    "img": "TheGoat.png",
                    "description": "This combines features from Goblin Mode (Stroke Waves) with Caniformia State (Separately adjustable tangent lengths).\r\rHere the Upper and Middle sections get one Taper and Wave along their combined length, and the Lower section gets another.\r\rIf you want to avoid the little glitch that you get inside the Upper joint, dig into the limb layer and turn on the Zig Zag. It’ll make it a bit slower to render.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048839470,
                    "type": "limb",
                    "label": "Hose Stack",
                    "url": "HoseStack.json",
                    "img": "HoseStack.png",
                    "description": "This has four ‘layers’. The bottom one acts like a kind of base which is always full length. The three topmost ones all have controls for their Trim Paths Start and End, Stroke Width, and Color. Their strokes are Butt Cap unless you set the Trim to 0 or 100, when they’ll gain a circle at the end, like the pink one has here.",
                    "tags": [
                        "curvature",
                        "outline",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853944,
                    "type": "limb",
                    "label": "High Top",
                    "url": "HighTop.json",
                    "img": "HighTop.png",
                    "description": "A parametric boot with various controls to customize it’s shape and size.  \r\rTo use these 3-bone limbs tagged with Foot Roll, you’ll need to change the Lower Length on the End Controller to adjust the distance between the ankle and the ball of the toes. Then style the foot how you want it, and set Weight to 100% and Weight Direction to flatten the base of the foot to the ground plane.",
                    "tags": [
                        "fast",
                        "foot roll",
                        "hand / foot",
                        "split",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048838051,
                    "type": "limb",
                    "label": "Foot with Toes",
                    "url": "FootwithToes.json",
                    "img": "FootwithToes.png",
                    "description": "This one takes the Taper ‘connected circles’ approach and applies it to two more sections - a foot, and it’s toes.\r\rThe foot has Width, Length and Angle controls for both sections.",
                    "tags": [
                        "fast",
                        "hand / foot",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838492,
                    "type": "limb",
                    "label": "Hand",
                    "url": "Hand.json",
                    "img": "Hand.png",
                    "description": "Alter the shapes inside the Hand Group to suit your needs. This group rotates as if it were parented to a Locator - it will not automatically flip when the Clockwise property goes from positive to negative (try Simple Foot if you need that). But there is a ‘Hand Scale’ property to let you manually flip the hand group.",
                    "tags": [
                        "fast",
                        "hand / foot",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848526,
                    "type": "limb",
                    "label": "Flat Foot",
                    "url": "FlatFoot.json",
                    "img": "FlatFoot.png",
                    "description": "A limb with a permanent cut-off angle, relative to the comp. You have controls to manually tweak the size, placement and angle of the rectangular ‘matte’ that does the cropping. Based off of Taper Redux for speed and simplicity.",
                    "tags": [
                        "fast",
                        "hand / foot",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838035,
                    "type": "limb",
                    "label": "Expanded Splits",
                    "url": "ExpandedSplits.json",
                    "img": "ExpandedSplits.png",
                    "description": "This is just like a standard Taper limb but with the addition of Expansion properties for the Upper and Lower sections. You still have Rounding and all the other controls from a Taper. ",
                    "tags": [
                        "fast",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852640,
                    "type": "limb",
                    "label": "Holstein",
                    "url": "Holstein.json",
                    "img": "Holstein.png",
                    "description": "Based on Taper Redux 3-bone but with some added patches that you can edit with your Pen tool. They’re limited to the upper section but there is a control to slide them left and right for a bit of perspective shift.",
                    "tags": [
                        "tapering"
                    ],
                    "structure": "3-bone"
                }
            ]
        },
        {
            "id": 2048841220,
            "type": "node",
            "label": "I - L",
            "url": "i_-_l",
            "description": "",
            "limbs": [
                {
                    "id": 2048853559,
                    "type": "limb",
                    "label": "Koi",
                    "url": "Koi.json",
                    "img": "Koi.png",
                    "description": "Intended to be animated on FK: set 3 keys on each FK Rotation property to bend it left, right and left again; then loop and offset each set of keys. Play with different easings and offsets to find the right sense of movement.\r\rThere are so many ways to tweak Stroke Taper and Wave properties… so we’ve only provided the basics in the pseudo effect. Hit UU to reveal the modified properties in the timeline.\r\rPlay with the Lengths and Curvature properties. They make a lot of difference to how it looks in motion.",
                    "tags": [],
                    "structure": "3-bone"
                },
                {
                    "id": 2048845769,
                    "type": "limb",
                    "label": "Little Shadow",
                    "url": "LittleShadow.json",
                    "img": "LittleShadow.png",
                    "description": "With Auto Shadow Width enabled, the shadow will grow and shrink as the limb unfolds. If you uncheck it, you can control the Shadow Width yourself, but it’ll usually mean having to set more keyframes.\r\rHave a look at Cute Crease if you don’t need the shadow.",
                    "tags": [
                        "asymmetrical",
                        "cartoon",
                        "crease",
                        "fast",
                        "outline",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048846619,
                    "type": "limb",
                    "label": "Knee Patch",
                    "url": "KneePatch.json",
                    "img": "KneePatch.png",
                    "description": "The patch will always be on the side that sticks out.\r\rPatch Size and Offset are relative to the Stroke Width.\r\rDelete the expression on the Patch Perspective property for more manual control.\r\rOuch is a similar limb.\r",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "fast",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841159,
                    "type": "limb",
                    "label": "Glowworm",
                    "url": "Glowworm.json",
                    "img": "Glowworm.png",
                    "description": "A gradient that crosses over from one side of the limb to the other as it runs down it’s length.\r\rThis makes it easier to form a visually continuous join between the limb layer and a body layer, since the limb is only one color at each end. ",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "gradient"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841680,
                    "type": "limb",
                    "label": "The Kasra",
                    "url": "TheKasra.json",
                    "img": "TheKasra.png",
                    "description": "This limb has a split with faux-3D rounding on the lower section and a crease at the joint that you can switch between being on the lower and the upper. The upper section can curve, the lower section cannot.\r\rCurvable Crease and Greaser Creaser are similar limbs.",
                    "tags": [
                        "cartoon",
                        "crease",
                        "curvature",
                        "fast",
                        "rounding",
                        "outline",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848778,
                    "type": "limb",
                    "label": "The Kasra Tee",
                    "url": "TheKasraTee.json",
                    "img": "TheKasraTee.png",
                    "description": "The sister limb to The Kasra - this time with the sleeve ending on the upper section. The lower section can curve, the upper section cannot.\r\rBoth Kasra limbs have an option for the hip / shoulder to have a square, open shape instead of the closed circular one in the preview images.",
                    "tags": [
                        "cartoon",
                        "crease",
                        "curvature",
                        "fast",
                        "rounding",
                        "outline",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844874,
                    "type": "limb",
                    "label": "Lowly Worm",
                    "url": "LowlyWorm.json",
                    "img": "LowlyWorm.png",
                    "description": "Just a simple path with an outline and two, straight color splits. If you overlap the splits or trim one right back, things should still look good.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838768,
                    "type": "limb",
                    "label": "Jims Arm",
                    "url": "JimsArm.json",
                    "img": "JimsArm.png",
                    "description": "This is transparent in the middle: the character’s body will show through. You can curve each side independently.\r\rYou can change the path that makes the hand, or add more paths next to it. But keep it’s Group and Stroke - those have expressions to keep them in sync when you change properties like the Outline Width and Color.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "hand / foot",
                        "hollow",
                        "outline",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838510,
                    "type": "limb",
                    "label": "Kurts Elbow Crease",
                    "url": "KurtsElbowCrease.json",
                    "img": "KurtsElbowCrease.png",
                    "description": "This has one Split property, limited to the Upper section. The crease in the elbow is fully automated, with controls for the angles over which it will grow.  ",
                    "tags": [
                        "crease",
                        "fast",
                        "outline",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841872,
                    "type": "limb",
                    "label": "Graduo",
                    "url": "Graduo.json",
                    "img": "Graduo.png",
                    "description": "Gradient Strokes only go straight from one point to another, they can’t bend. To get around that, this limb uses two of them, one from the start to the joint, and another from the joint to the end. \r\rEditing stroke gradient colors can be fiddly so we’ve used grayscale gradients, and you have a Tint effect that’s easier to access, which tints the monochrome shape into a colorful one.\r\rCheck out Smoove for a similar limb that has tapering.",
                    "tags": [
                        "curvature",
                        "fast",
                        "gradient"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848066,
                    "type": "limb",
                    "label": "Inverted Gradient Taper 1",
                    "url": "InvertedGradientTaper1.json",
                    "img": "InvertedGradientTaper1.png",
                    "description": "This, and the #2 and #3 versions, are based on Inverted Stroke Taper, but they have gradients instead of a flat color.\r\rThis one uses a simple method where the gradient runs from the start to the end of the limb. You can see from the preview image how that can look a little odd as the limb gets more folded. You will need to edit the gradient colors directly.\r",
                    "tags": [
                        "curvature",
                        "fast",
                        "gradient",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048848082,
                    "type": "limb",
                    "label": "Inverted Gradient Taper 2",
                    "url": "InvertedGradientTaper2.json",
                    "img": "InvertedGradientTaper2.png",
                    "description": "This, the #1 and #3 versions, are based on Inverted Stroke Taper, but they have gradients instead of a flat color.\r\rThis one breaks the limb path into two sections and has a separate Gradient Stroke for each one, allowing it to look more like it runs along the limb without needing any hacky effects. You will need to edit the gradient colors directly.",
                    "tags": [
                        "curvature",
                        "fast",
                        "gradient",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048850026,
                    "type": "limb",
                    "label": "Inverted Stroke Taper Outline",
                    "url": "InvertedStrokeTaperOutline.json",
                    "img": "InvertedStrokeTaperOutline.png",
                    "description": "A version of Inverted Stroke Taper, with an outline, which uses a neat bit of math to stay a consistent width. This one also has color controls on the limb layer.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048845546,
                    "type": "limb",
                    "label": "Inverted Stroke Taper",
                    "url": "InvertedStrokeTaper.json",
                    "img": "InvertedStrokeTaper.png",
                    "description": "If you’re simulating perspective, it’s sometimes more useful to have a tapered stroke that gets wider instead of narrower - so you can increase the size of the end as it gets closer. That’s what this does.\r\rThe pseudo effect has a Stroke Width property in pixels and then a percentage slider for the amount of taper expansion. Otherwise, it’s just like a default Path limb.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853155,
                    "type": "limb",
                    "label": "Lumo",
                    "url": "Lumo.json",
                    "img": "Lumo.png",
                    "description": "Similar to The Ponch 3-bone.\r\rIf you want the inner color to terminate inside the caps, pickwhip the Path in Group 2 to the Path in Group 1, then change the Stroke in Group 2 to Round Cap, and reset it’s Taper. ",
                    "tags": [
                        "curvature",
                        "gradient"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048848106,
                    "type": "limb",
                    "label": "Inverted Gradient Taper 3",
                    "url": "InvertedGradientTaper3.json",
                    "img": "InvertedGradientTaper3.png",
                    "description": "This, and the #1 and #2 versions, are based on Inverted Stroke Taper, but they have gradients instead of a flat color.\r\rThis one uses the same effect stack method as The Ponch to make the gradient. So you get a very true gradation along the path, and color controls in the pseudo effect.",
                    "tags": [
                        "curvature",
                        "gradient",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844271,
                    "type": "limb",
                    "label": "I Got Stripes",
                    "url": "IGotStripes.json",
                    "img": "IGotStripes.png",
                    "description": "This is like Pinstripe, but for multiple stripes. To add or remove stripes, twirl down the limb layer and find the Stripes Group. Delete or duplicate as many of the topmost ‘Stripe XX’ groups as you need.\r\rThis limb gets progressively slower as you add stripes. For something fast, try Business Time",
                    "tags": [
                        "curvature",
                        "slow",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048854116,
                    "type": "limb",
                    "label": "Low Top",
                    "url": "LowTop.json",
                    "img": "LowTop.png",
                    "description": "A parametric shoe with various controls to customize it’s shape and size.  \r\rTo use these 3-bone limbs tagged with Foot Roll, you’ll need to change the Lower Length on the End Controller to adjust the distance between the ankle and the ball of the toes. Then style the foot how you want it, and set Weight to 100% and Weight Direction to flatten the base of the foot to the ground plane.",
                    "tags": [
                        "fast",
                        "foot roll",
                        "hand / foot",
                        "split",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048849607,
                    "type": "limb",
                    "label": "Lower Sleeve 3D",
                    "url": "LowerSleeve3D.json",
                    "img": "LowerSleeve3D.png",
                    "description": "This is very similar to Upper Sleeve 3D but with the split on the lower section.\r\rDocsplainer is a similar limb with an outline.",
                    "tags": [
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838409,
                    "type": "limb",
                    "label": "Legacy Taper",
                    "url": "LegacyTaper.json",
                    "img": "LegacyTaper.png",
                    "description": "This is how tapers were built in early versions of Limber, and it has no Rounding on the splits.\r\rIt’s built from a series of Ellipses with wedge shapes in between them that respond to their sizes. Because of this setup, you can disable the expressions on the circles and size them manually - it won’t break anything. Then you can make cuffs and sleeves that are wider than the rest of the limb.\r\rYou’re probably better off with Lower Sleeve or Upper Sleeve, but some folks are used to doing it manually with this limb.",
                    "tags": [
                        "fast",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838567,
                    "type": "limb",
                    "label": "Lower Sleeve",
                    "url": "LowerSleeve.json",
                    "img": "LowerSleeve.png",
                    "description": "This has two colors only. If you need the split to be on the Upper section, try Upper Sleeve.",
                    "tags": [
                        "fast",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                }
            ]
        },
        {
            "id": 2048842158,
            "type": "node",
            "label": "M - O",
            "url": "m_-_o",
            "description": "",
            "limbs": [
                {
                    "id": 2048846558,
                    "type": "limb",
                    "label": "Ouch",
                    "url": "Ouch.json",
                    "img": "Ouch.png",
                    "description": "The bruise will always be on the side that sticks out.\r\rBruise Width and Offset are relative to the Stroke Width.\r\rTo change the colors, adjust the Tint effect directly.\r\rKnee Patch is a similar limb.",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "fast",
                        "gradient",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838826,
                    "type": "limb",
                    "label": "Nothing Up My Sleeve",
                    "url": "NothingUpMySleeve.json",
                    "img": "NothingUpMySleeve.png",
                    "description": "You can change the cuff length, and where it is along the limb. The cuff has faux-3D rounding.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839944,
                    "type": "limb",
                    "label": "Omnidroid",
                    "url": "Omnidroid.json",
                    "img": "Omnidroid.png",
                    "description": "This one easily could be customized for a stripy breton sleeve. Try turning off the bottommost Stroke for a slightly different mechanical style. The subdivision lines are built from a dashed stroke, so they’re nice and fast. They will also stay at a constant (user controlled) quantity as the limb’s length changes.\r\rWorm is a similar limb with consistent width strokes across the limb.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "sequential",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839853,
                    "type": "limb",
                    "label": "Mordecai",
                    "url": "Mordecai.json",
                    "img": "Mordecai.png",
                    "description": "The tapering will affect the width at the Start of the limb, so you should set it up to integrate into your character’s body, and then probably leave it alone. The taper cannot be wider at the Start than the End.\r\rYou can slide the band along the limb, but it works best on straighter sections. It has faux-3D rounding.\r\rThe shoulder outline can be trimmed around the circle, to help integrate it into a body.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 32,
                    "type": "limb",
                    "label": "Nudesplainer",
                    "url": "Nudesplainer.json",
                    "img": "Nudesplainer.png",
                    "description": "This is a simplified version of Teesplainer / Docsplainer. Unlike those limbs, you can re-order the Lower Group and Upper Group inside the limb layer to change where the crease runs.\r",
                    "tags": [
                        "crease",
                        "outline",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837998,
                    "type": "limb",
                    "label": "Outlined Path",
                    "url": "OutlinedPath.json",
                    "img": "OutlinedPath.png",
                    "description": "This limb provides three, separate outlined strokes, with width and color controls for each. If you only need two strokes, try Simple Trim Path Outline.\r\rThis limb only works as expected when the Sizes are smaller towards the end.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048840500,
                    "type": "limb",
                    "label": "Michelin",
                    "url": "Michelin.json",
                    "img": "Michelin.png",
                    "description": "The bulge widths are automatically calculated to fill the limb. Designed for astronauts or puffy jackets. It does get slower if you add a lot of bulges.",
                    "tags": [
                        "curvature",
                        "outline",
                        "sequential"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838115,
                    "type": "limb",
                    "label": "Muscles",
                    "url": "Muscles.json",
                    "img": "Muscles.png",
                    "description": "This has two methods for bulging - Leg and Arm.\r\rLeg muscles can bulge out on one side only, and the bulge is nearer the top of the section, as you can see here. Leg muscles have an Offset property to shift them from one side to the other.\r\rArm muscles always bulge out both sides and the bulge is always halfway between the joints. \r\rCheck out Pumped and Realistic Forearm for similar limbs.",
                    "tags": [
                        "fast",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852909,
                    "type": "limb",
                    "label": "Muscles 3-bone",
                    "url": "Muscles3-bone.json",
                    "img": "Muscles3-bone.png",
                    "description": "A 3-bone version of Muscles with the same two methods for bulging - Leg and Arm.\r\rLeg muscles can bulge out on one side only, and the bulge is nearer the top of the section. Leg muscles have an Offset property to shift them from one side to the other.\r\rArm muscles always bulge out both sides, as you can see here, and the bulge is always halfway between the joints.\r\rGoblin Mode is a similar limb.",
                    "tags": [
                        "fast",
                        "split",
                        "tapering"
                    ],
                    "structure": "3-bone"
                }
            ]
        },
        {
            "id": 2048844944,
            "type": "node",
            "label": "P - R",
            "url": "p_-_r",
            "description": "",
            "limbs": [
                {
                    "id": 2048839556,
                    "type": "limb",
                    "label": "Pathwarper",
                    "url": "Pathwarper.json",
                    "img": "Pathwarper.png",
                    "description": "This limb can warp ANY path along itself, which is a unique method to Limber and to this limb.\r\rThe path you see here is just something we drew to test it out. Edit the path inside the Reference Shape Group to get a feel for it. It will compress and expand almost like a puppet limb\r\rThere is a drawback: it’s very slow. Try to keep the number of points in the shape as low as possible, and that’ll help.",
                    "tags": [
                        "advanced",
                        "cartoon",
                        "curvature",
                        "hollow",
                        "outline",
                        "slow",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838788,
                    "type": "limb",
                    "label": "Pinstripe",
                    "url": "Pinstripe.json",
                    "img": "Pinstripe.png",
                    "description": "This is Curved Bezier Taper with an added pinstripe that can be shifted from one side of the limb to the other. Add some dashes to it’s stroke and you’ve got stitching. A related limb is Fast Offset Path, but that one can’t taper. ",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048846433,
                    "type": "limb",
                    "label": "Realistic Forearm",
                    "url": "RealisticForearm.json",
                    "img": "RealisticForearm.png",
                    "description": "This was designed to help with the different forearm profiles you get when a wrist rotates.\r\rThere are controls for the length of four separate tangents on the forearm taper shape. You can easily animate a rotating wrist, and the have the forearm go from something more symmetrical, like this preview image, to having a straighter line on one side and the curve of the muscle on the other. ",
                    "tags": [
                        "asymmetrical",
                        "fast",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839151,
                    "type": "limb",
                    "label": "Parallel Lines",
                    "url": "ParallelLines.json",
                    "img": "ParallelLines.png",
                    "description": "If your design requires an outlined limb with open caps AND transparency in the middle, this is probably what you need. It’s fast and reliable, and the outline can either scale along with the character, or stay at constant stroke width.\r\rThis relies on Offset Paths, which mean it can’t taper - have a look at Jims Arm if you need that.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "hollow",
                        "outline"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839905,
                    "type": "limb",
                    "label": "Rigby",
                    "url": "Rigby.json",
                    "img": "Rigby.png",
                    "description": "The ‘hairs’ look slightly hand-drawn due to a Wiggle Paths and a Wave on the Stroke. Turn those off and it‘ll become more regular.\r\rYou’ll get more dashes as the limb gets longer. ",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "sequential",
                        "stripe"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048846953,
                    "type": "limb",
                    "label": "Pointy Pants",
                    "url": "PointyPants.json",
                    "img": "PointyPants.png",
                    "description": "The opening to the sleeve is shaped like a leaf or eye instead of being circular.\r\rThe Torrence, Faux 3D Sleeve and Cuphead are similar limbs.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048843491,
                    "type": "limb",
                    "label": "Pencil",
                    "url": "Pencil.json",
                    "img": "Pencil.png",
                    "description": "This is a basic Path limb with a Wiggle Paths and some added effects to simulate a pencil line.   \r\rThere is no special pseudo effect controls on this one, instead you can just hit UU on the limb to reveal the modified properties, and adjust things directly. \r\rA similar limb is The Boiler.",
                    "tags": [
                        "curvature"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837864,
                    "type": "limb",
                    "label": "Path with Foot",
                    "url": "PathwithFoot.json",
                    "img": "PathwithFoot.png",
                    "description": "This limb adds a fourth point to the end of the path, like a foot, with controls for length and tangent angles, so you can simulate toe and heel roll.\r\r3 Part Path with Foot is the same thing with each segment of the path broken into a separate path and stroke.",
                    "tags": [
                        "curvature",
                        "fast",
                        "hand / foot"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048853239,
                    "type": "limb",
                    "label": "Path with Foot 3-bone",
                    "url": "PathwithFoot3-bone.json",
                    "img": "PathwithFoot3-bone.png",
                    "description": "This limb adds a fifth point to the end of the path, like a foot (or paw), with controls for length and tangent angles, so you can simulate toe and heel roll. So it’s effectively a 4-bone limb.\r\rIt’s similar to Path with Foot, with an added outline and quick access controls for Width, Tapering and Color. ",
                    "tags": [
                        "curvature",
                        "fast",
                        "hand / foot",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048837902,
                    "type": "limb",
                    "label": "Path with End Rounding",
                    "url": "PathwithEndRounding.json",
                    "img": "PathwithEndRounding.png",
                    "description": "This limb adds faux-3D rounding to the Start and End caps of the stroke that you can animate for an illusion of depth.\r\rChange the Stroke Color and the caps will automatically change too.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839135,
                    "type": "limb",
                    "label": "Quadcolor",
                    "url": "Quadcolor.json",
                    "img": "Quadcolor.png",
                    "description": "Four colors, each with it’s own trim length. Round Caps at the start and Butt Caps at the other end. Tapering is proportional for all four colors - via an Upper Width and a Lower Width property rather than just a taper amount.",
                    "tags": [
                        "curvature",
                        "fast",
                        "split",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837881,
                    "type": "limb",
                    "label": "Path for Adding Strokes",
                    "url": "PathforAddingStrokes.json",
                    "img": "PathforAddingStrokes.png",
                    "description": "This limb adds a second stroke which is expression-linked back to the base path so it runs faster than if you just duplicated the base path (which is what most people do).\r\rSimple Trim Path is a very similar limb where the top Stroke has a butt cap on the lower end.\r ",
                    "tags": [
                        "curvature",
                        "fast",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841904,
                    "type": "limb",
                    "label": "Pumped",
                    "url": "Pumped.json",
                    "img": "Pumped.png",
                    "description": "This is similar to Muscles but here you have curvature and the bulges are done with a Wave on the Stroke. This doesn’t have a movable color split - it’s limited to the joint.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838676,
                    "type": "limb",
                    "label": "Round Corners Taper",
                    "url": "RoundCornersTaper.json",
                    "img": "RoundCornersTaper.png",
                    "description": "This is a bit like The Animade, because it uses Round Corners to smooth the shape. But instead of being a simple path, this one is based on Square Elbow, and has the three Widths of a Taper.\r\rCheck out Curved Bezier Taper for something similar but more bendy and organic feeling.",
                    "tags": [
                        "curvature",
                        "fast",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841100,
                    "type": "limb",
                    "label": "The Ponch",
                    "url": "ThePonch.json",
                    "img": "ThePonch.png",
                    "description": "Unlike most of the gradient limbs, you could taper the bottom stroke here. Try adding a Layer Style stroke if you need a clean outline.\r\rCredit goes to Michael Ponch who came up with a neat method for making a gradient follow a curved path. ",
                    "tags": [
                        "curvature",
                        "gradient"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852929,
                    "type": "limb",
                    "label": "The Ponch 3-bone",
                    "url": "ThePonch3-bone.json",
                    "img": "ThePonch3-bone.png",
                    "description": "A 3-bone version of The Ponch.\r\rYou could taper the bottom stroke here. Try adding a Layer Style stroke if you need a clean outline. ",
                    "tags": [
                        "curvature",
                        "gradient"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048846156,
                    "type": "limb",
                    "label": "Pant with Stripe",
                    "url": "PantwithStripe.json",
                    "img": "PantwithStripe.png",
                    "description": "This is exactly the same as Lower Sleeve, but with the addition of a stripe.",
                    "tags": [
                        "fast",
                        "split",
                        "stripe",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                }
            ]
        },
        {
            "id": 2048842162,
            "type": "node",
            "label": "S - T",
            "url": "s_-_t",
            "description": "",
            "limbs": [
                {
                    "id": 2048839731,
                    "type": "limb",
                    "label": "Thin Line Highlight",
                    "url": "ThinLineHighlight.json",
                    "img": "ThinLineHighlight.png",
                    "description": "There is a checkbox called Angle Follows Limb which is on by default. This makes the highlight ‘stick’ to the limb as it moves. If you uncheck it, you have manual control over the Highlight Angle, and it will behave more like light coming from a fixed direction.\r\rApart from the highlight this is identical to Thin Line.",
                    "tags": [
                        "asymmetrical",
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841142,
                    "type": "limb",
                    "label": "Side Stroke",
                    "url": "SideStroke.json",
                    "img": "SideStroke.png",
                    "description": "A Path limb with a secondary color that runs along one side. Use the Flip checkbox to change which side. The side stroke isn’t perfect at very high Width or very low Curvature values.",
                    "tags": [
                        "asymmetrical",
                        "curvature"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841176,
                    "type": "limb",
                    "label": "Twister",
                    "url": "Twister.json",
                    "img": "Twister.png",
                    "description": "This came about whilst making Glowworm. The tapered, topmost stroke doesn’t hug the shape of the main stroke underneath perfectly if you use very low Curvature or very high Width, but it’s pretty close most of the time.",
                    "tags": [
                        "asymmetrical",
                        "curvature"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841125,
                    "type": "limb",
                    "label": "Sideburn",
                    "url": "Sideburn.json",
                    "img": "Sideburn.png",
                    "description": "This is the Side Stroke limb with some effects added to blur the two colors together.",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "gradient"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048837982,
                    "type": "limb",
                    "label": "Slow Offset Path",
                    "url": "SlowOffsetPath.json",
                    "img": "SlowOffsetPath.png",
                    "description": "This limb was designed for cases where you want to offset a path on one side only. Fast Offset Path is a better solution for most cases.\r\rThere are controls for the amount of offset and subdivision (smoothness) of the path. It gets slower as you increase the subdivision.  If that’s an issue, you could keep it low and then turn up the subdivision when you render.\r\rIf you don’t want bendiness, set Curvature to 0.1 and reduce the Offset Path Subdivision to 2.",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "slow",
                        "stripe"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838694,
                    "type": "limb",
                    "label": "Swept Elbow",
                    "url": "SweptElbow.json",
                    "img": "SweptElbow.png",
                    "description": "Here you can adjust the Inner and Outer edges independently, from straight lines (like Square Elbow) to fully curved (like Curved Bezier Taper).\r\rThe difference between this and Curved Bezier Taper is that here, the tangents stay long and change angle as you decrease the ‘sweeping’, whereas in that limb, the tangents stay at the same angle and get shorter, so you don’t get the same sharp point.\r\rCurved Bezier Taper is a similar limb.",
                    "tags": [
                        "asymmetrical",
                        "fast",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048850601,
                    "type": "limb",
                    "label": "Simple Crease",
                    "url": "SimpleCrease.json",
                    "img": "SimpleCrease.png",
                    "description": "This is a simple Path limb with an outline and a crease in the joint, but no curvature.\r\rYou can keyframe the crease to be on the Upper or Lower section, and it’ll look like that section is ‘in front’ when you fold the limb up. \r\rCute Crease and Curvable Crease are similar limbs.",
                    "tags": [
                        "cartoon",
                        "crease",
                        "fast",
                        "outline"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048840335,
                    "type": "limb",
                    "label": "SpongeBob",
                    "url": "SpongeBob.json",
                    "img": "SpongeBob.png",
                    "description": "Similar to ‘Bell End’ but without the outline on the sleeve.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839768,
                    "type": "limb",
                    "label": "Thick Line",
                    "url": "ThickLine.json",
                    "img": "ThickLine.png",
                    "description": "Inspired by UPA and 60’s Hanna-Barbera, this one keeps things pretty simple. You can adjust the taper on the outline, and in both directions on the limb itself.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852600,
                    "type": "limb",
                    "label": "Thick Line 3-bone",
                    "url": "ThickLine3-bone.json",
                    "img": "ThickLine3-bone.png",
                    "description": "The 3-bone version of Thick Line.\r\rInspired by UPA and 60’s Hanna-Barbera, this one keeps things pretty simple. You can adjust the taper on the outline, and in both directions on the limb itself.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048839807,
                    "type": "limb",
                    "label": "Thin Line",
                    "url": "ThinLine.json",
                    "img": "ThinLine.png",
                    "description": "This might be the perfect open-ended, minimal outlined limb. You can taper this in either direction (or both at once).\r\rBecause it’s simple, it’s fast.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852620,
                    "type": "limb",
                    "label": "Thin Line 3-bone",
                    "url": "ThinLine3-bone.json",
                    "img": "ThinLine3-bone.png",
                    "description": "The 3-bone version of Thin Line.\r\rThis might be the perfect open-ended, minimal outlined limb. You can taper this in either direction (or both at once).\r\rBecause it’s simple, it’s fast.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "tapering",
                        "utility"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048839402,
                    "type": "limb",
                    "label": "Steamboat Willie",
                    "url": "SteamboatWillie.json",
                    "img": "SteamboatWillie.png",
                    "description": "Taken out of context, this looks a bit cylindrical. But add a character’s body and feet, with some effects to roughen everything up, and this can do a pretty good impression of 1920’s rubberhose animation.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839245,
                    "type": "limb",
                    "label": "The Torrence",
                    "url": "TheTorrence.json",
                    "img": "TheTorrence.png",
                    "description": "This is similar to Faux 3D Sleeve but with an outline. ",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839540,
                    "type": "limb",
                    "label": "Tubuloso",
                    "url": "Tubuloso.json",
                    "img": "Tubuloso.png",
                    "description": "This is similar to Nothing Up My Sleeve, but here the cuff is more organic and cartoony feeling, and the way it looks when the rounding flips from side to side is pretty special.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839929,
                    "type": "limb",
                    "label": "Topo",
                    "url": "Topo.json",
                    "img": "Topo.png",
                    "description": "You could re-purpose this for anything that needs studs, suckers, nodules, lumps or hairs.\r\rIt uses an expression to draw a second bezier path that follows the main path, jutting out at either side. We’ve included controls for Random Distribution and Random Length.\r\rPreview speed will improve as you lower the number of suckers.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "sequential",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048839669,
                    "type": "limb",
                    "label": "Thick Line Alternate",
                    "url": "ThickLineAlternate.json",
                    "img": "ThickLineAlternate.png",
                    "description": "This has the same aim as Thick Line, but goes about it with more user control.\r\rHere you’ve got three Widths to play with, as well as separate Curvature controls for each side. So if you put in a bit more time and keyframe the shape as it animates, you can get more distinctive results.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "outline",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048842980,
                    "type": "limb",
                    "label": "Teesplainer",
                    "url": "Teesplainer.json",
                    "img": "Teesplainer.png",
                    "description": "Based on a Taper limb, so you can easily control the profile from start to end, but it has no curvature. The split, which has full rounding control, is restricted to the upper section. There are controls so you can easily trim the line across the cuff, or remove it completely.\r\rThis is the sister to Docsplainer which has the split on the lower section.",
                    "tags": [
                        "crease",
                        "outline",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048841888,
                    "type": "limb",
                    "label": "Smoove",
                    "url": "Smoove.json",
                    "img": "Smoove.png",
                    "description": "This uses the same shape layer gradient technique as Graduo (two gradients that meet at the limb’s joint), but here we’ve added expressions to the Stroke Tapers that make it function like a single continuous tapered stroke.\r\rThere’s a property on the pseudo called ‘Gradient Center Spread’ which helps with very wide strokes. If your limb is more skinny, you can dial this down and get a slightly more accurate gradient.\r\rTo change the colors, adjust the Tint effect directly.",
                    "tags": [
                        "curvature",
                        "fast",
                        "gradient",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048850043,
                    "type": "limb",
                    "label": "Simple Trim Path Outline",
                    "url": "SimpleTrimPathOutline.json",
                    "img": "SimpleTrimPathOutline.png",
                    "description": "The outline version of Simple Trim Path.\r\rDeeky Two and Outlined Path are similar limbs.",
                    "tags": [
                        "curvature",
                        "fast",
                        "outline",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048840808,
                    "type": "limb",
                    "label": "Santa",
                    "url": "Santa.json",
                    "img": "Santa.png",
                    "description": "This is Faux 3D Path in reverse - so the lower section is wider than the upper.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048834622,
                    "type": "limb",
                    "label": "Tapered Path",
                    "url": "TaperedPath.json",
                    "img": "TaperedPath.png",
                    "description": "This combines the features of a Taper (Colors, Widths, Splits) with a Path limb (Curvature). \r\rIt’s almost the Ultimate Limber Limb, except that it only works as expected when the Sizes are smaller towards the end. If you need the sizes to be larger towards the end, use Tapered Path Reverse.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852656,
                    "type": "limb",
                    "label": "Tapered Path 3-bone",
                    "url": "TaperedPath3-bone.json",
                    "img": "TaperedPath3-bone.png",
                    "description": "This combines the features of a Taper (Colors, Widths, Splits) with a Path limb (Curvature). \r\rIt only works as expected when the Sizes are smaller towards the end, and it only has splits on the Upper and Lower sections. If you need a split on the Middle section, use Tapered Path 3-bone Alt.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048852682,
                    "type": "limb",
                    "label": "Tapered Path 3-bone Alt",
                    "url": "TaperedPath3-boneAlt.json",
                    "img": "TaperedPath3-boneAlt.png",
                    "description": "This combines the features of a Taper (Colors, Widths, Splits) with a Path limb (Curvature). \r\rIt only works as expected when the Sizes are smaller towards the end, and it only has one split on the Middle section. If you need a split on the Upper or  Lower section, use Tapered Path 3-bone instead.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048850059,
                    "type": "limb",
                    "label": "Tapered Path Outline",
                    "url": "TaperedPathOutline.json",
                    "img": "TaperedPathOutline.png",
                    "description": "This combines the features of a Taper (Colors, Widths, Splits, Rounding) with a Path limb (Curvature) and an outline. \r\rIt only works as expected when the Sizes are smaller towards the end.\r\rColored Path Outline might be a better option if you don’t need the taper.",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844320,
                    "type": "limb",
                    "label": "Tapered Path Reverse",
                    "url": "TaperedPathReverse.json",
                    "img": "TaperedPathReverse.png",
                    "description": "This is the same as Tapered Path, but for when you want to taper the start of the limb instead of the end. It combines the features of a Taper (Colors, Widths, Splits) with a Path limb (Curvature).",
                    "tags": [
                        "curvature",
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844838,
                    "type": "limb",
                    "label": "Simple Trim Path",
                    "url": "SimpleTrimPath.json",
                    "img": "SimpleTrimPath.png",
                    "description": "Pretty similar to Path for Adding Strokes, but we’ve done a bit more work for you to make a very simple, second stroke with a ‘Round Cap’ at the top and a butt cap at the end.\r\rThere are Color and Width controls provided for this one.",
                    "tags": [
                        "curvature",
                        "fast",
                        "split",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048845918,
                    "type": "limb",
                    "label": "Skeleton",
                    "url": "Skeleton.json",
                    "img": "Skeleton.png",
                    "description": "This also makes a great leg for birds, insects and anything very bony.\r\rEach of the three bulges has it’s own width and length controls. They’re built with Stroke Waves, so it works well with curvature.\r\rThere is no outline. But you can always add a Layer Style Stroke.",
                    "tags": [
                        "curvature",
                        "fast",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838603,
                    "type": "limb",
                    "label": "Simple Foot",
                    "url": "SimpleFoot.json",
                    "img": "SimpleFoot.png",
                    "description": "This is similar to Foot with Toes, but without toes.",
                    "tags": [
                        "fast",
                        "hand / foot",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852214,
                    "type": "limb",
                    "label": "Square Foot",
                    "url": "SquareFoot.json",
                    "img": "SquareFoot.png",
                    "description": "A cross between Square Elbow and Simple Foot that provides a built-in foot extension for very boxy characters. The foot works in exactly the same way as in SImple Foot.\r\rThere is a circle at the start so it’s easier to join on to the rest of the character. You can delete it if you need to.",
                    "tags": [
                        "fast",
                        "hand / foot",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048850077,
                    "type": "limb",
                    "label": "Shorts and Socks 3D",
                    "url": "ShortsandSocks3D.json",
                    "img": "ShortsandSocks3D.png",
                    "description": "This has a lot in common with Upper Sleeve 3D, but you still have a Split on the Lower section.",
                    "tags": [
                        "fast",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048847096,
                    "type": "limb",
                    "label": "Sock Band",
                    "url": "SockBand.json",
                    "img": "SockBand.png",
                    "description": "This is a default Taper on the Upper section, which has rounding, with a Legacy Taper style Lower section that includes an extra ‘band’ of color.\r\rThe Lower section split has no rounding.",
                    "tags": [
                        "fast",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838163,
                    "type": "limb",
                    "label": "Shorts and Socks",
                    "url": "ShortsandSocks.json",
                    "img": "ShortsandSocks.png",
                    "description": "This is like Upper Sleeve, but you still have a Split on the Lower section.",
                    "tags": [
                        "fast",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838638,
                    "type": "limb",
                    "label": "Square Elbow",
                    "url": "SquareElbow.json",
                    "img": "SquareElbow.png",
                    "description": "A single bezier path based around the three Sizes of a Taper but without a circular joint. Instead it has a sharp point which will become extremely long and pointy as you close up the limb.\r\rThe rig adds Ellipses at the start and end so it’s easier to join on to the rest of the character. You can delete them if you need to.",
                    "tags": [
                        "fast",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048842283,
                    "type": "limb",
                    "label": "Taper Redux",
                    "url": "TaperRedux.json",
                    "img": "TaperRedux.png",
                    "description": "If your character needs the classic Taper shape limbs, but only needs a single color for them, this should run slightly faster than a default taper because it has fewer, shorter expressions.\r\rThere’s no Color Splits, Rounding or Square End options here.",
                    "tags": [
                        "fast",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852448,
                    "type": "limb",
                    "label": "Taper Redux 3-bone",
                    "url": "TaperRedux3-bone.json",
                    "img": "TaperRedux3-bone.png",
                    "description": "If your character needs the classic Taper shape limbs, but only needs a single color for them, this should run slightly faster than a default taper because it has fewer, shorter expressions.\r\rThere’s no Color Splits, Rounding or Square End options here.",
                    "tags": [
                        "fast",
                        "tapering",
                        "utility"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 2048839962,
                    "type": "limb",
                    "label": "T Rex",
                    "url": "TRex.json",
                    "img": "TRex.png",
                    "description": "The dots are a dashed stroke, but an expression on the Gap size keeps them stuck to the limb sections as they change length. Play with the Trim Path properties to control where the dots start and stop.  ",
                    "tags": [
                        "sequential",
                        "tapering"
                    ],
                    "structure": "2-bone"
                }
            ]
        },
        {
            "id": 2048842161,
            "type": "node",
            "label": "U - Z",
            "url": "u_-_z",
            "description": "",
            "limbs": [
                {
                    "id": 2048841968,
                    "type": "limb",
                    "label": "Xenomorph",
                    "url": "Xenomorph.json",
                    "img": "Xenomorph.png",
                    "description": "This is designed for you to use your own, custom shapes with - it does not need to look like this preview image at all.\r\rTwirl down the limb layer contents and inside the ‘Shapes’ group, delete or duplicate as many of the topmost groups as you need, and edit the shapes inside them. If you delete all except ‘Shape 01’, you can refine it and then duplicate it to generate several identical instances, as we have done here.\r\rSimilar limbs are Topo and Doyouthinkhesaurus. ",
                    "tags": [
                        "advanced",
                        "asymmetrical",
                        "curvature",
                        "fast",
                        "sequential",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 1087,
                    "type": "limb",
                    "label": "Wrangler",
                    "url": "Wrangler.json",
                    "img": "Wrangler.png",
                    "description": "A basic tapered path with two extra strokes that you can use for stitching or a crease.\r\rThis is another one where the dashed stroke stretches automatically to maintain a constant number of dashes. Here, you can set the dash value manually. The gaps will be the same length as the dashes. ",
                    "tags": [
                        "asymmetrical",
                        "curvature",
                        "fast",
                        "stripe",
                        "tapering",
                        "unique joint"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048844854,
                    "type": "limb",
                    "label": "Worm",
                    "url": "Worm.json",
                    "img": "Worm.png",
                    "description": "The lines running across will stay evenly distributed along the limb. To add or remove them, twirl down the limb layer contents and inside the ‘Shapes’ group, delete or duplicate as many of the topmost numbered groups as you need.\r\rSee Omnidroid and Xenomorph for similar limbs.",
                    "tags": [
                        "cartoon",
                        "curvature",
                        "fast",
                        "outline",
                        "sequential",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048849312,
                    "type": "limb",
                    "label": "Upper Sleeve Outline",
                    "url": "UpperSleeveOutline.json",
                    "img": "UpperSleeveOutline.png",
                    "description": "An outlined taper with faux-3D rounding on a T-shirt sleeve.\r\rThis is very similar to Teesplainer, but with the added ability to keyframe whether the crease at the joint runs from the lower section or the upper.",
                    "tags": [
                        "crease",
                        "fast",
                        "outline",
                        "rounding",
                        "split",
                        "tapering"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048852949,
                    "type": "limb",
                    "label": "Wasp",
                    "url": "Wasp.json",
                    "img": "Wasp.png",
                    "tags": [
                        "curvature",
                        "fast",
                        "sequential",
                        "stripe",
                        "tapering"
                    ],
                    "structure": "3-bone"
                },
                {
                    "id": 1068,
                    "type": "limb",
                    "label": "Woodcutter",
                    "url": "Woodcutter.json",
                    "img": "Woodcutter.png",
                    "description": "You can curve the joint, and trim the sleeve anywhere along it, but it has no rounding. It’s simple, but it runs very fast.",
                    "tags": [
                        "curvature",
                        "fast",
                        "split"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048849469,
                    "type": "limb",
                    "label": "Upper Sleeve 3D",
                    "url": "UpperSleeve3D.json",
                    "img": "UpperSleeve3D.png",
                    "description": "A taper with faux-3D rounding on a T-shirt sleeve.\r\rUpper Sleeve Outline is the same limb with an outline.",
                    "tags": [
                        "fast",
                        "rounding",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                },
                {
                    "id": 2048838582,
                    "type": "limb",
                    "label": "Upper Sleeve",
                    "url": "UpperSleeve.json",
                    "img": "UpperSleeve.png",
                    "description": "Default Tapers are great but folks often want to make cuffs and sleeves wider.\r\rThis one does that for T-shirts or Shorts. If you need the Split to be on the Lower section, try Lower Sleeve.",
                    "tags": [
                        "fast",
                        "split",
                        "tapering",
                        "utility"
                    ],
                    "structure": "2-bone"
                }
            ]
        }
    ]
}