{    "limbs": [        {            "id": 2048842160,            "type": "node",            "label": "Cartoon Inspired",            "url": "cartoon_inspired",            "description": "Outlined, cartoony styles. Some simple, some complex.",            "limbs": [                {                    "id": 2048839421,                    "type": "limb",                    "label": "Bell End",                    "url": "BellEnd.json",                    "img": "BellEnd.png",                    "description": "A perfectly imperfect MIckey Mouse leg with lots of customization options. Check out Tubuloso, Spongebob and Nothing Up My Sleeve for similar vibes.",                    "tags": [                        "curved",                        "split",                        "perspective"                    ]                },                {                    "id": 2048840187,                    "type": "limb",                    "label": "Bluey",                    "url": "Bluey.json",                    "img": "Bluey.png",                    "description": "Deceptively simple. If you need a curvy limb with a color split on both the fill color AND the outline, this is probably your ticket. You can taper this limb in one direction.",                    "tags": [                        "curved",                        "split"                    ]                },                {                    "id": 2048841755,                    "type": "limb",                    "label": "Cuphead",                    "url": "Cuphead.json",                    "img": "Cuphead.png",                    "description": "Here you have controls for all the colors, the length and width of the leg, pant and sock. The pant and sock have independent controls for faux-3D perspective angle.\r\rYou can safely delete the sock and / or the pant shape groups from this limb and nothing will break.",                    "tags": [                        "curved",                        "split",                        "perspective"                    ]                },                {                    "id": 2048841855,                    "type": "limb",                    "label": "Cuphead Vintage",                    "url": "CupheadVintage.json",                    "img": "CupheadVintage.png",                    "description": "This is just the Cuphead limb with some Wave in the strokes, which would probably work best on 2’s / at 12fps, because it can jump around a bit.\r\rThe effect stack on the limb gives it some texture - but in practice you would probably apply all these to  the character as a whole, once it’s precomped. They slow it down too much otherwise.",                    "tags": [                        "curved",                        "split",                        "perspective"                    ]                },                {                    "id": 2048839837,                    "type": "limb",                    "label": "Finns Arm",                    "url": "FinnsArm.json",                    "img": "FinnsArm.png",                    "description": "One color split. Tapering in one direction. Outlines. Open butt caps.\rSimple, fast and robust. ",                    "tags": [                        "curved",                        "split"                    ]                },                {                    "id": 2048839868,                    "type": "limb",                    "label": "Finns Leg",                    "url": "FinnsLeg.json",                    "img": "FinnsLeg.png",                    "description": "Similar to Finns Arm but with the option of a different width for the lower section to the upper. This one has tapering on that lower section only, but it can run in both directions.",                    "tags": [                        "curved",                        "split"                    ]                },                {                    "id": 2048839853,                    "type": "limb",                    "label": "Mordecai",                    "url": "Mordecai.json",                    "img": "Mordecai.png",                    "description": "It’s weirdly tricky to do an outlined band on a tapering, curvy limb like this.\r\rYou can reduce the taper to zero, but you can’t taper it in the opposite direction. You can slide the band along the limb, but it works best on straight sections. The band has faux-3D rounding. The shoulder outline can be trimmed around the circle.",                    "tags": [                        "curved",                        "faux3d"                    ]                },                {                    "id": 2048840335,                    "type": "limb",                    "label": "SpongeBob",                    "url": "SpongeBob.json",                    "img": "SpongeBob.png",                    "description": "Similar to ‘Bell End’ but without the outline on the sleeve.",                    "tags": [                        "curved",                        "split",                        "faux3d"                    ]                },                {                    "id": 2048839402,                    "type": "limb",                    "label": "Steamboat Willie",                    "url": "SteamboatWillie.json",                    "img": "SteamboatWillie.png",                    "description": "Taken out of context, this looks a bit cylindrical. But add a character’s body and feet, with some effects to roughen everything up, and this can do a pretty good impression of 1920’s rubberhose animation.",                    "tags": [                        "curved",                        "split"                    ]                },                {                    "id": 2048839768,                    "type": "limb",                    "label": "Thick Line",                    "url": "ThickLine.json",                    "img": "ThickLine.png",                    "description": "Inspired by UPA and 60’s Hanna-Barbera, this one keeps things pretty simple. You can adjust the taper on the outline, and in both directions on the limb itself.",                    "tags": [                        "curved"                    ]                },                {                    "id": 2048839669,                    "type": "limb",                    "label": "Thick Line Alternate",                    "url": "ThickLineAlternate.json",                    "img": "ThickLineAlternate.png",                    "description": "This has the same aim as Thick Line, but goes about it with more user control.\r\rHere you’ve got three Widths to play with, as well as separate Curvature controls for each side. So if you put in a bit more time and keyframe the shape as it animates, you can get more distinctive results.",                    "tags": [                        "curved"                    ]                },                {                    "id": 2048839807,                    "type": "limb",                    "label": "Thin Line",                    "url": "ThinLine.json",                    "img": "ThinLine.png",                    "description": "This might be the perfect open-ended, minimal outlined limb. You can taper this in either direction (or both at once) and that’s about it.\r\rBecause it’s simple, it’s fast.",                    "tags": [                        "curved"                    ]                },                {                    "id": 2048839731,                    "type": "limb",                    "label": "Thin Line Highlight",                    "url": "ThinLineHighlight.json",                    "img": "ThinLineHighlight.png",                    "description": "The highlight has an Angle Follows Limb setting which overrides the Highlight Angle.\r\rApart from the highlight this is identical to Thin Line.",                    "tags": [                        "curved"                    ]                }            ]        },        {            "id": 2048842154,            "type": "node",            "label": "Creases",            "url": "creases",            "description": "These all feature some kind of crease or fold line at the crux of the joint",            "limbs": [                {                    "id": 2048841703,                    "type": "limb",                    "label": "Curvable Crease",                    "url": "CurvableCrease.json",                    "img": "CurvableCrease.png",                    "description": "This is a basic Path limb with an added outline and crease at the joint. You can set the crease to overlap either the upper or lower section and it automatically switches sides when the limb changes direction.",                    "tags": [                        "curved",                        "crease"                    ]                },                {                    "id": 2048842697,                    "type": "limb",                    "label": "Cute Crease",                    "url": "CuteCrease.json",                    "img": "CuteCrease.png",                    "description": "This is kind of a cross between Curvable Crease and The Animade. It doesn’t curve like most Path-based limbs, but it has a nice automated Round Corners operator that makes it less pointy at the joint when you fold it up.\r\rYou can set the crease to overlap either the upper or lower section and it automatically switches sides when the limb changes direction.",                    "tags": [                        "crease",                        "split"                    ]                },                {                    "id": 2048841722,                    "type": "limb",                    "label": "Greaser Creaser",                    "url": "GreaserCreaser.json",                    "img": "GreaserCreaser.png",                    "description": "Faux-3D rounding on the upper. The crease is on the upper section but you can have it on the lower by dragging the Lower Group above the Upper Group inside the limb layer contents. The open ended outlines can make it easier to integrate into certain body and hand designs.  \r\rNo curvature or tapering on this one.",                    "tags": [                        "crease",                        "split"                    ]                },                {                    "id": 2048838510,                    "type": "limb",                    "label": "Kurts Elbow Crease",                    "url": "KurtsElbowCrease.json",                    "img": "KurtsElbowCrease.png",                    "description": "This has one Split property, limited to the Upper section. The crease in the elbow is fully automated, with controls over the angles over which it will grow.  ",                    "tags": [                        "crease",                        "tapered",                        "split"                    ]                },                {                    "id": 2048841680,                    "type": "limb",                    "label": "The Kasra",                    "url": "TheKasra.json",                    "img": "TheKasra.png",                    "description": "This limb has a split with faux-3D rounding and a crease: both are always on the lower section. The upper section can curve, the lower section cannot.\r\rHave a look at Curvable Crease and Greaser Creaser if you need the crease to come from the upper section instead of the lower",                    "tags": [                        "curved",                        "crease",                        "split"                    ]                }            ]        },        {            "id": 2048841220,            "type": "node",            "label": "Gradient",            "url": "gradient",            "description": "Gradients, blurs and ramps",            "limbs": [                {                    "id": 2048841159,                    "type": "limb",                    "label": "Glowworm",                    "url": "Glowworm.json",                    "img": "Glowworm.png",                    "description": "A gradient that crosses over from one side of the limb to the other as it runs down it’s length.\r\rThis makes it easier to form a visually continuous join between the limb layer and a body layer, since the limb is only one color at each end. ",                    "tags": [                        "curved",                        "gradient"                    ]                },                {                    "id": 2048841872,                    "type": "limb",                    "label": "Graduo",                    "url": "Graduo.json",                    "img": "Graduo.png",                    "description": "Gradient Strokes only go straight from one point to another, they can’t bend. To get around that, this limb uses two of them, one from the start to the joint, and another from the joint to the end. \r\rEditing stroke gradient colors can be fiddly so we’ve used grayscale gradients, and you have a Tint effect that’s easier to access, which tints the monochrome shape into a colorful one.\r\rCheck out Smoove for a similar limb that has tapering.",                    "tags": [                        "curved",                        "gradient"                    ]                },                {                    "id": 2048841125,                    "type": "limb",                    "label": "Sideburn",                    "url": "Sideburn.json",                    "img": "Sideburn.png",                    "description": "This is the Side Stroke limb with some effects added to blur the two colors together.",                    "tags": [                        "curved",                        "gradient"                    ]                },                {                    "id": 2048841888,                    "type": "limb",                    "label": "Smoove",                    "url": "Smoove.json",                    "img": "Smoove.png",                    "description": "This uses the same shape layer gradient technique as Graduo (two gradients that meet at the limb’s joint), but here we’ve added expressions to the Stroke Tapers that make it function like a single continuous tapered stroke.\r\rThere’s a property on the pseudo called ‘Gradient Center Spread’ which helps with very wide strokes. If your limb is more skinny, you can dial this down and get a slightly more accurate gradient.\r\rTo change the colors, adjust the Tint effect directly.",                    "tags": [                        "curved",                        "gradient",                        "tapered"                    ]                },                {                    "id": 2048841100,                    "type": "limb",                    "label": "The Ponch",                    "url": "ThePonch.json",                    "img": "ThePonch.png",                    "description": "Unlike most of these gradient limbs, you could taper the bottom stroke here. Try adding a Layer Style stroke if you need a clean outline.\r\rCredit goes to Michael Ponch who came up with a neat method for making a gradient follow a curved path. ",                    "tags": [                        "curved",                        "gradient",                        "tapered"                    ]                }            ]        },        {            "id": 2048842158,            "type": "node",            "label": "Hands and Feet",            "url": "hands_and_feet",            "description": "These all have an extra appendage of some kind. The 'hands' tend not to flip when you invert the Clockwise property. The 'feet' usually do.",            "limbs": [                {                    "id": 2048837810,                    "type": "limb",                    "label": "3 Part Path with Foot",                    "url": "3PartPathwithFoot.json",                    "img": "3PartPathwithFoot.png",                    "description": "This is the same as Path with Foot except that the three sections of the limb are all separate paths, so you can style them independently.\r\rAttributes like color and stroke can be altered manually in the layer. The Stroke Widths do have an expression so they work with Limber’s scaling, but you can still edit the values.\r\rIf you don’t want the foot, just delete the Foot Group from the limb layer.",                    "tags": [                        "curved",                        "foot"                    ]                },                {                    "id": 2048841802,                    "type": "limb",                    "label": "Bootylicious",                    "url": "Bootylicious.json",                    "img": "Bootylicious.png",                    "description": "You can turn up the opacity of the Fill for this, or use transparent like it is by default. The ‘boot’ auto-rotates and you also have an angle control to override that. This won’t flip side automatically when Clockwise goes from above zero to less than zero. You can keyframe the angle by 180º instead.",                    "tags": [                        "curved",                        "foot",                        "hollow"                    ]                },                {                    "id": 2048838051,                    "type": "limb",                    "label": "Foot with Toes",                    "url": "FootwithToes.json",                    "img": "FootwithToes.png",                    "description": "This one takes the Taper ‘connected circles’ approach and applies it to two more sections - for a foot, and it’s toes.\r\rThe foot has Width, Length and Angle controls for both sections.",                    "tags": [                        "foot",                        "tapered",                        "split"                    ]                },                {                    "id": 2048838492,                    "type": "limb",                    "label": "Hand",                    "url": "Hand.json",                    "img": "Hand.png",                    "description": "Alter the shapes inside the Hand Group to suit your needs. This group rotates as if it were parented to a Locator - it will not flip when the Clockwise property goes from positive to negative (try Simple Foot if you need that).",                    "tags": [                        "hand",                        "tapered",                        "split"                    ]                },                {                    "id": 2048837864,                    "type": "limb",                    "label": "Path with Foot",                    "url": "PathwithFoot.json",                    "img": "PathwithFoot.png",                    "description": "This limb adds a fourth point to the end of the path, like a foot, with controls for length, and tangent angles so you can simulate toe and heel roll.\r\r3 Part Path with Foot is the same thing with each segment of the path broken into a separate path and stroke.",                    "tags": [                        "foot",                        "curved"                    ]                },                {                    "id": 2048838603,                    "type": "limb",                    "label": "Simple Foot",                    "url": "SimpleFoot.json",                    "img": "SimpleFoot.png",                    "description": "Like Foot with Toes but without toes.",                    "tags": [                        "tapered",                        "foot"                    ]                },                {                    "id": 2048840005,                    "type": "limb",                    "label": "The Claw",                    "url": "TheClaw.json",                    "img": "TheClaw.png",                    "description": "There are so many different design elements you could incorporate into a 2d robotic arm.  As it stands this is pretty simple, but you could easily add touches to the different parts, and make it into something more unique.",                    "tags": [                        "curved",                        "hand"                    ]                }            ]        },        {            "id": 2048842162,            "type": "node",            "label": "Joint Ventures",            "url": "joint_ventures",            "description": "These are all focussed on something about the joint and the way it responds to being bent and open.",            "limbs": [                {                    "id": 2048838659,                    "type": "limb",                    "label": "Curved Joint Taper",                    "url": "CurvedJointTaper.json",                    "img": "CurvedJointTaper.png",                    "description": "This has three variable Sizes, like a Taper, but one side is a continuous curve, while the other is a sharp angle. It’ll always be the outside side that curves. Oh and there’s a stroked path underneath all that (the white bit) so you have that option too. Just delete it if you like.\r\rIt’s sort of a cross between Curved Bezier Taper and Square Elbow. ",                    "tags": [                        "curved",                        "taper"                    ]                },                {                    "id": 2048838676,                    "type": "limb",                    "label": "Round Corners Taper",                    "url": "RoundCornersTaper.json",                    "img": "RoundCornersTaper.png",                    "description": "This is a bit like The Animade, because it uses Round Corners to smooth the shape. But instead of being a simple path, this one is based on Square Elbow, so it has the three Widths of a Taper.\r\rCheck out Curved Bezier Taper for something similar but more bendy and organic feeling.",                    "tags": [                        "curved",                        "taper"                    ]                },                {                    "id": 2048838638,                    "type": "limb",                    "label": "Square Elbow",                    "url": "SquareElbow.json",                    "img": "SquareElbow.png",                    "description": "A single bezier path based around the three Sizes of a Taper but without a circular joint. Instead it has a sharp point which will become extremely long and pointy as you close up the limb. So don’t do that.\r\rThe rig adds Ellipses at the start and end so it’s easier to join on to the rest of the character. But you could delete them if you need to.",                    "tags": [                        "taper"                    ]                },                {                    "id": 2048838694,                    "type": "limb",                    "label": "Swept Elbow",                    "url": "SweptElbow.json",                    "img": "SweptElbow.png",                    "description": "Here you can adjust the Inner and Outer edges independently, from straight lines (like Square Elbow) to fully curved (like Curved Bezier Taper).\r\rThe difference between this and Curved Bezier Taper is that here, the tangents stay long and change angle as you decrease the ‘sweeping’, whereas in that limb, the tangents stay at the same angle and get shorter, so you don’t get the same sharp point.",                    "tags": [                        "curved",                        "taper"                    ]                }            ]        },        {            "id": 2048838034,            "type": "node",            "label": "Miscellaneous",            "url": "miscellaneous",            "description": "Some things don't fit into neat categories. So we've put them into this other category. Neat, huh?",            "limbs": [                {                    "id": 2048840415,                    "type": "limb",                    "label": "Airgela",                    "url": "Airgela.json",                    "img": "Airgela.png",                    "description": "Loosely based on a popular social network’s illustration system.\r\rIf you need the outline to continue all the way around, change Stroke 2 inside Bottom Fill to Round Cap and drag the End Cap and Start Cap Groups above the Bottom Fill",                    "tags": [                        "curved",                        "split"                    ]                },                {                    "id": 2048838035,                    "type": "limb",                    "label": "Expanded Splits",                    "url": "ExpandedSplits.json",                    "img": "ExpandedSplits.png",                    "description": "This is just like a standard Taper limb but with the addition of Expansion properties for the Upper and Lower sections. You still have Rounding and all the other controls from a Taper. ",                    "tags": [                        "tapered",                        "split"                    ]                },                {                    "id": 2048838768,                    "type": "limb",                    "label": "Jims Arm",                    "url": "JimsArm.json",                    "img": "JimsArm.png",                    "description": "This is transparent in the middle so the character’s body will show through. You can curve each side independently.\r\rYou can change the path that makes the hand, or add more paths next to it. But keep it’s Group and Stroke - those have expressions to keep them in sync when you change properties like the Outline Width and Color.",                    "tags": [                        "hollow",                        "curved",                        "hand"                    ]                },                {                    "id": 2048838115,                    "type": "limb",                    "label": "Muscles",                    "url": "Muscles.json",                    "img": "Muscles.png",                    "description": "This has two methods for bulging - Leg and Arm. Leg muscles can bulge out on one side only, and the bulge is nearer the top, as you can see here. Arm muscles always bulge out both sides and the bulge is always halfway between the joints. The Leg muscles have an Offset property so you can kind of shift them from one side to the other.",                    "tags": [                        "tapered",                        "split"                    ]                },                {                    "id": 2048839556,                    "type": "limb",                    "label": "Pathwarper",                    "url": "Pathwarper.json",                    "img": "Pathwarper.png",                    "description": "Ok, this might look like a kid’s tv show from the 1980’s, and there’s no shame in that. But this limb can warp ANY path along itself. Yes, warp. Almost like the puppet tool, but this is all 100% vector. Edit the path inside the Reference Shape Group and you’ll see what I mean.\r\rThe drawback? It’s slow. Try to keep the number of points in the shape as low as possible, and that’ll help it speed up a bit. ",                    "tags": [                        "curved"                    ]                },                {                    "id": 2048838195,                    "type": "limb",                    "label": "The Boorman",                    "url": "TheBoorman.json",                    "img": "TheBoorman.png",                    "description": "A more advanced version of the Pant limb, with some specific extra features like a pocket and an outline and a ‘Diagonality’ property for the end of the pants.\r\rSometimes a user asks for something, and we make it. This was one of those.",                    "tags": [                        "tapered",                        "split"                    ]                }            ]        },        {            "id": 2048842159,            "type": "node",            "label": "Old School",            "url": "old_school",            "description": "Would you believe some of these limbs began life in a different rigging tool? That's how old they are.",            "limbs": [                {                    "id": 2048839470,                    "type": "limb",                    "label": "Hose Stack",                    "url": "HoseStack.json",                    "img": "HoseStack.png",                    "description": "This has four ‘layers’. The bottom one acts like a kind of base which is always full length. The three topmost ones all have controls for their Trim Paths Start and End, Stroke Width, and Color. Their strokes are Butt Cap unless you set the Trim to 0 or 100, when they’ll gain a circle at the end, like the red one has here.",                    "tags": [                        "curved",                        "split"                    ]                },                {                    "id": 2048837998,                    "type": "limb",                    "label": "Outlined Path",                    "url": "OutlinedPath.json",                    "img": "OutlinedPath.png",                    "description": "This limb provides three, separate outlined strokes, with width, color and split controls. The outline is a constant stroke width, even when you scale up the limb.\r\rThis limb mostly only works as expected when the Sizes are smaller towards the end.",                    "tags": [                        "outline",                        "curved"                    ]                },                {                    "id": 2048839135,                    "type": "limb",                    "label": "Quadcolor",                    "url": "Quadcolor.json",                    "img": "Quadcolor.png",                    "description": "Four colors, each with it’s own trim length. Round Caps at the start and Butt Caps at the other end. Tapering is proportional for all four colors - via an Upper Width and a Lower Width property rather than just a taper amount. So if you need the end to be a precise pixel size, it’s straightforward.",                    "tags": [                                            ]                },                {                    "id": 1068,                    "type": "limb",                    "label": "Woodcutter",                    "url": "Woodcutter.json",                    "img": "Woodcutter.png",                    "description": "2015 called and it wants it’s character design back.\r\rSeriously though, the pay-off for the simplicity of this is it’s speed. If we include something like faux-3D Rounding in a limb, it’ll inevitably slow it down, even if it’s set to zero.",                    "tags": [                                            ]                },                {                    "id": 1087,                    "type": "limb",                    "label": "Wrangler",                    "url": "Wrangler.json",                    "img": "Wrangler.png",                    "description": "A basic tapered path with two extra strokes that you can use for stitching or a crease.\r\rThis is another one where the dashed stroke stretches automatically to maintain a constant number of dashes. Here, you can set the dash value manually. The gaps will be the same length as the dashes. ",                    "tags": [                                            ]                }            ]        },        {            "id": 2048842161,            "type": "node",            "label": "One-sided",            "url": "one-sided",            "description": "Sigh. If only 'Trim Paths' worked predicatbly with 'Offset Paths'. Until then…",            "limbs": [                {                    "id": 2048841819,                    "type": "limb",                    "label": "Fast Offset Path",                    "url": "FastOffsetPath.json",                    "img": "FastOffsetPath.png",                    "description": "This limb provides a much faster offset path than the old version (now called Slow Offset Path).\r\rOffsetting a path on one side only is strangely difficult in After Effects. Have a look at Pinstripe if you need the base stroke to be tapered.",                    "tags": [                                            ]                },                {                    "id": 2048838260,                    "type": "limb",                    "label": "Half Taper",                    "url": "HalfTaper.json",                    "img": "HalfTaper.png",                    "description": "This is intended for use as a matte, so you can get shading on one side of a Taper or Circles limb. That works best if you use this as an orphan limb layer.",                    "tags": [                                            ]                },                {                    "id": 2048838788,                    "type": "limb",                    "label": "Pinstripe",                    "url": "Pinstripe.json",                    "img": "Pinstripe.png",                    "description": "This is Curved Bezier Taper with an added pinstripe that can be shifted from one side of the limb to the other. Add some dashes to it’s stroke and you’ve got stitching. A related limb is Fast Offset Path, but that one can’t taper like this. ",                    "tags": [                                            ]                },                {                    "id": 2048841142,                    "type": "limb",                    "label": "Side Stroke",                    "url": "SideStroke.json",                    "img": "SideStroke.png",                    "description": "A Path limb with a secondary color that runs along one side. Use the Flip checkbox to change which side. The side stroke isn’t perfect at very high Width or very low Curvature values.",                    "tags": [                                            ]                },                {                    "id": 2048837982,                    "type": "limb",                    "label": "Slow Offset Path",                    "url": "SlowOffsetPath.json",                    "img": "SlowOffsetPath.png",                    "description": "This limb was designed for cases where you want to offset a path on one side only. Fast Offset Path is a much better implementation for 99% of cases.\r\rThere are controls for the amount of offset and subdivision (smoothness) of the path. It gets slower as you increase the subdivision.  If that’s an issue, you could keep it low and then turn up the subdivision when you render.\r\rIf you don’t want bendiness, set Curvature to 0.1 and reduce the Offset Path Subdivision to 2.",                    "tags": [                                            ]                },                {                    "id": 2048841176,                    "type": "limb",                    "label": "Twister",                    "url": "Twister.json",                    "img": "Twister.png",                    "description": "This came about whilst making Glowworm. The tapered, topmost stroke doesn’t hug the shape of the main stroke underneath perfectly if you use very low Curvature or very high Width, but it’s pretty close most of the time.\r\rIt’s named after the Ice Cream, not the game.",                    "tags": [                                            ]                }            ]        },        {            "id": 2048842157,            "type": "node",            "label": "Sequential",            "url": "sequential",            "description": "These all have a feature that repeats along the limb's length. They're mostly path-based.",            "limbs": [                {                    "id": 2048841836,                    "type": "limb",                    "label": "Davey Jones",                    "url": "DaveyJones.json",                    "img": "DaveyJones.png",                    "description": "Pop this on to FK or FreeK and you’ve got a quick, flexible chain rig that won’t spawn more links when you stretch it longer.\r\rThe holes are actually a fill color, but if you needed them to be transparent you could change them to a saturated green, then pop the Keylight effect on and set it’s Screen Color to the same green.",                    "tags": [                                            ]                },                {                    "id": 2048841952,                    "type": "limb",                    "label": "Doyouthinkhesaurus",                    "url": "Doyouthinkhesaurus.json",                    "img": "Doyouthinkhesaurus.png",                    "description": "You can set the width and length of the spikes at either end of the limb and the sizes automatically interpolate between those values. There’s a Center Offset property to push the spikes out towards the edge. You can change the main stroke’s Taper manually.\r\rTo increase the number of spikes, you need to twirl down the layer > Contents > Limb > Spikes, select the topmost group (it’ll be called ‘Spike 05’ when you first download it) and hit Cmd / Ctrl + D to duplicate that group. Delete the topmost group(s) to get less spikes. ",                    "tags": [                                            ]                },                {                    "id": 2048840500,                    "type": "limb",                    "label": "Michelin",                    "url": "Michelin.json",                    "img": "Michelin.png",                    "description": "Similar to Topo but a bit simpler and here the bulge widths are automatically calculated to fill the limb, based on it’s length.",                    "tags": [                                            ]                },                {                    "id": 2048839944,                    "type": "limb",                    "label": "Omnidroid",                    "url": "Omnidroid.json",                    "img": "Omnidroid.png",                    "description": "This one easily could be customized for a stripy breton sleeve. Or try turning off the bottommost Stroke for a slightly different mechanical style. The subdivision lines are built from a dashed stroke, so they’re nice and fast. But, unlike in Rigby these ones are adaptive and stay at a constant (user controlled) total as the limb’s length changes.",                    "tags": [                                            ]                },                {                    "id": 2048839905,                    "type": "limb",                    "label": "Rigby",                    "url": "Rigby.json",                    "img": "Rigby.png",                    "description": "The ‘hairs’ look slightly hand-drawn due to a Wiggle Paths and a Wave on the Stroke. Turn those off and it‘ll become more regular.\r\rYou’ll get more dashes as the limb gets longer. If you want the number of dashes to stay constant, check out Omnidroid. ",                    "tags": [                                            ]                },                {                    "id": 2048839962,                    "type": "limb",                    "label": "T Rex",                    "url": "TRex.json",                    "img": "TRex.png",                    "description": "The dots are a dashed stroke, but an expression on the Gap size keeps them ‘stuck’ to the limb sections as they change length. Play with the Trim Path properties to control where the dots start and stop.  ",                    "tags": [                                            ]                },                {                    "id": 2048839929,                    "type": "limb",                    "label": "Topo",                    "url": "Topo.json",                    "img": "Topo.png",                    "description": "You could re-purpose this for anything that needs studs, suckers, nodules, lumps or hairs.\r\rIt uses an expression to draw a second bezier path that follows the main path, jutting out at either side. We’ve included controls for Random Distribution and Random Length.\r\rPreview speed will increase as you lower the number of suckers.",                    "tags": [                                            ]                },                {                    "id": 2048841968,                    "type": "limb",                    "label": "Xenomorph",                    "url": "Xenomorph.json",                    "img": "Xenomorph.png",                    "description": "On the face of it this has some similarities with Topo and Doyouthinkhesaurus. But under the hood it’s designed for you to use your own, custom shapes with.\r\rTwirl down the limb layer contents and inside the ‘Shapes’ group, delete or duplicate as many of the topmost groups as you need, and edit the shapes inside them. If you delete all except ‘Shape 01’, you can refine it and then duplicate it to generate several identical instances. ",                    "tags": [                                            ]                }            ]        },        {            "id": 2048842163,            "type": "node",            "label": "Simple and Fast",            "url": "simple_and_fast",            "description": "Limber's default Path limbs are things of beautiful simplicity. But sometimes there's a way of adding just a touch of something extra whilst maintaining their essence of purity.",            "limbs": [                {                    "id": 2048843491,                    "type": "limb",                    "label": "Pencil",                    "url": "Pencil.json",                    "img": "Pencil.png",                    "description": "This is a basic Path limb with a Wiggle Paths and some added effects to simulate a pencil line.   \r\rThere is no special pseudo effect controls on this one, instead you can just hit UU on the limb to reveal the modified properties, and adjust things directly. \r\rA similar limb is The Boiler.",                    "tags": [                                            ]                },                {                    "id": 2048839385,                    "type": "limb",                    "label": "The Animade",                    "url": "TheAnimade.json",                    "img": "TheAnimade.png",                    "description": "The only limb in the library that’s so simple it doesn’t have any controls at all. The unique curvature style comes from using Round Corners with an adaptive Radius.\r\rAw. So cute. ",                    "tags": [                                            ]                },                {                    "id": 95,                    "type": "limb",                    "label": "The Boiler",                    "url": "TheBoiler.json",                    "img": "TheBoiler.png",                    "description": "This is a simple Path limb with an integrated, vector ‘line boil’ that simulates a hand drawn look.\r\rThe FPS setting determines how often the boil changes, and is relative to the comp’s frame rate. So if your comp is 24fps and you want to animate on 2’s - set it to 12, or to animate on 3’s set it to 8. Turn on Motion Sensing and the boil will only trigger when the limb is moving.",                    "tags": [                                            ]                }            ]        },        {            "id": 2048842156,            "type": "node",            "label": "Sleeves",            "url": "sleeves",            "description": "Various limbs that have an inner and an outer, usually separated by a cuff or sleeve opening. You might also want to look in the Cartoon Inspired, Creases, Old School and Utility folders.",            "limbs": [                {                    "id": 2048842840,                    "type": "limb",                    "label": "Docsplainer",                    "url": "Docsplainer.json",                    "img": "Docsplainer.png",                    "description": "Based on a Taper limb, so you can easily control the profile from start to end, but you can’t make it curve. The split, which has full rounding control, is restricted to the lower section. There are controls so you can easily trim the line across the cuff, or remove it completely.\r\rThis is the sister to Teesplainer which has the split on the upper section.",                    "tags": [                                            ]                },                {                    "id": 2048833911,                    "type": "limb",                    "label": "Faux 3D Path",                    "url": "Faux3DPath.json",                    "img": "Faux3DPath.png",                    "description": "Here you’ve got two Width controls, a Split anywhere along the path, and faux-3D Rounding for the split with a filled, extruded kind of look. Faux 3D Sleeve is the same thing but open-looking.\r\rBoth of these limbs limit the Lower Width so it cannot be wider than the Upper Width.",                    "tags": [                                            ]                },                {                    "id": 2048837962,                    "type": "limb",                    "label": "Faux 3D Sleeve",                    "url": "Faux3DSleeve.json",                    "img": "Faux3DSleeve.png",                    "description": "This is based on Faux 3D Path, but has an open appearance to the sleeve end.",                    "tags": [                                            ]                },                {                    "id": 2048838567,                    "type": "limb",                    "label": "Lower Sleeve (Pant)",                    "url": "LowerSleevePant.json",                    "img": "LowerSleevePant.png",                    "description": "In Legacy Taper I mentioned how you could make cuffs and sleeves wider. This one does it all for you and simplifies a few things, so it’s faster and easier. If you need the split to be on the Upper section, try Upper Sleeve (T shirt).",                    "tags": [                                            ]                },                {                    "id": 2048838826,                    "type": "limb",                    "label": "Nothing Up My Sleeve",                    "url": "NothingUpMySleeve.json",                    "img": "NothingUpMySleeve.png",                    "description": "You can change the cuff length, and where it is along the limb. The cuff has faux-3D rounding.",                    "tags": [                                            ]                },                {                    "id": 2048840808,                    "type": "limb",                    "label": "Santa",                    "url": "Santa.json",                    "img": "Santa.png",                    "description": "This is Faux 3D Path but I’ve reversed it - so the lower section is wider than the upper.\r\rHappy Christmas!",                    "tags": [                                            ]                },                {                    "id": 2048838163,                    "type": "limb",                    "label": "Shorts and socks",                    "url": "Shortsandsocks.json",                    "img": "Shortsandsocks.png",                    "description": "This is like Upper Sleeve (T shirt), but you still have a Split on the Lower section. So I guess it’s either shorts and socks or a T shirt and wristband.\r\rGenerally these ‘sleeve’ tapers with the wider, sticky-out sections don’t have any Rounding. And neither does this one.",                    "tags": [                                            ]                },                {                    "id": 2048842980,                    "type": "limb",                    "label": "Teesplainer",                    "url": "Teesplainer.json",                    "img": "Teesplainer.png",                    "description": "Based on a Taper limb, so you can easily control the profile from start to end, but you can’t make it curve. The split, which has full rounding control, is restricted to the upper section. There are controls so you can easily trim the line across the cuff, or remove it completely.\r\rThis is the sister to Docsplainer which has the split on the lower section.",                    "tags": [                                            ]                },                {                    "id": 2048839245,                    "type": "limb",                    "label": "The Torrence",                    "url": "TheTorrence.json",                    "img": "TheTorrence.png",                    "description": "This is similar to Faux 3D Sleeve but with an outline. ",                    "tags": [                                            ]                },                {                    "id": 2048839540,                    "type": "limb",                    "label": "Tubuloso",                    "url": "Tubuloso.json",                    "img": "Tubuloso.png",                    "description": "This one’s so much fun to animate with. Similar to Nothing Up My Sleeve, but here the cuff is more organic and cartoony feeling, and the way it looks when the rounding flips from side to side is pretty special.",                    "tags": [                                            ]                },                {                    "id": 2048838582,                    "type": "limb",                    "label": "Upper Sleeve (T Shirt)",                    "url": "UpperSleeveTShirt.json",                    "img": "UpperSleeveTShirt.png",                    "description": "Default Tapers are great but folks often want to make cuffs and sleeves wider. This one does that for T-shirts or Shorts. If you need the Split to be on the Lower section, try Lower Sleeve.",                    "tags": [                                            ]                }            ]        },        {            "id": 2048838227,            "type": "node",            "label": "Utility",            "url": "utility",            "description": "These are all pretty fit-for-purpose AND responsive. Tapered Path is a bit of an uber-limb. Colored Path and Parallel Lines do their jobs better than anything else.",            "limbs": [                {                    "id": 2048842334,                    "type": "limb",                    "label": "Art Cropper",                    "url": "ArtCropper.json",                    "img": "ArtCropper.png",                    "description": "Any artwork you add to this Taper using the ‘Add Art’ button will be automatically cropped to the taper shape. Which is pretty cool - you could even animate the art from side-to-side to simulate a faux-3D rotation. The taper itself has all the usual features apart from Square End.\r\rTo delete the tattoo art that’s here for demo purposes, twirl down the limb layer Contents > Limb > Upper Group > Rigged Upper and delete the named groups you see inside there (and do the same for the Lower Group). So long as you leave the other groups and Merge Paths parts, your own artwork should rig as normal and get cropped.",                    "tags": [                                            ]                },                {                    "id": 2048837927,                    "type": "limb",                    "label": "Colored Path",                    "url": "ColoredPath.json",                    "img": "ColoredPath.png",                    "description": "This limb replicates the Color, Split and Rounding controls of a Taper, in a Path limb. You can still use Curvature to round out the joint, and everything is based on stroked paths instead of filled beziers.\r\rThere’s no tapering with this, which helps keep it a bit faster. Check out Tapered Path, if you want that.",                    "tags": [                                            ]                },                {                    "id": 2048838228,                    "type": "limb",                    "label": "Curved Bezier Taper",                    "url": "CurvedBezierTaper.json",                    "img": "CurvedBezierTaper.png",                    "description": "This is an attempt to add curvature to a Taper-able limb which dates back to before Adobe added Tapers to Strokes. But it’s still got it’s uses.\r\rIt keeps the three Sizes, which allow you to vary the width along the limb in ways that tapered Strokes can’t. With some bezier math we’ve applied tangents to the shape, making it kinda like a Path limb, but you can adjust the Curvature of each side separately. The bad news is: it’s one color only, with no Splits or Rounding.",                    "tags": [                                            ]                },                {                    "id": 2048838409,                    "type": "limb",                    "label": "Legacy Taper",                    "url": "LegacyTaper.json",                    "img": "LegacyTaper.png",                    "description": "This is how tapers were built way back in Limber v1.5 or so. You have a bunch of Ellipses with wedge shapes in between them that respond to their sizes.\r\rWhy is this here? One thing you can do with this is to disable the expressions on the circles and size them manually - you won’t break things. And then you can make cuffs and sleeves that are wider than the rest of the limb.\r\rYou’re probably better off with Lower Sleeve (Pant) or Upper Sleeve (T shirt). But there are some old tutorials out there that use this limb.",                    "tags": [                                            ]                },                {                    "id": 2048839151,                    "type": "limb",                    "label": "Parallel Lines",                    "url": "ParallelLines.json",                    "img": "ParallelLines.png",                    "description": "If your design requires an outlined limb with open caps AND transparency in the middle, this is probably what you want. It’s fast and reliable, and the outline can either scale along with the character, or stay at constant stroke width.\r\rThis relies on Offset Paths, which mean it can’t taper - have a look at Jims Arm if you need that.",                    "tags": [                                            ]                },                {                    "id": 2048837881,                    "type": "limb",                    "label": "Path for adding strokes",                    "url": "Pathforaddingstrokes.json",                    "img": "Pathforaddingstrokes.png",                    "description": "This limb adds a second stroke which is expression-linked back to the base path so it runs faster than if you just duplicated the base path (which is what most people do).\r\rNow that you know this, you can make rigs that run faster than your friends’ rigs. \r\rIf you want to duplicate a default path limb’s path, eg. so you can use Trim Paths, use this. ",                    "tags": [                                            ]                },                {                    "id": 2048837902,                    "type": "limb",                    "label": "Path with End Rounding",                    "url": "PathwithEndRounding.json",                    "img": "PathwithEndRounding.png",                    "description": "This limb adds faux-3D rounding to the start and end caps of the stroke that you can animate for an illusion of depth.\r\rChange the Stroke Color and the caps will automatically change too.",                    "tags": [                                            ]                },                {                    "id": 2048842283,                    "type": "limb",                    "label": "Taper Redux",                    "url": "TaperRedux.json",                    "img": "TaperRedux.png",                    "description": "If your character needs the classic Taper shape limbs, but only needs a single color for them, this should run slightly faster than a default taper, because it has fewer, shorter expressions. There’s no Color Splits, Rounding or Square End options here.",                    "tags": [                                            ]                },                {                    "id": 2048834622,                    "type": "limb",                    "label": "Tapered Path",                    "url": "TaperedPath.json",                    "img": "TaperedPath.png",                    "description": "This does a fair job of combining the features of a Taper (Colors, Widths, Splits) with a Path limb (Curvature). \r\rIt’s almost the Ultimate Limber Limb©, but…\r\rThe limitation is that it only works when the Sizes are smaller towards the end.",                    "tags": [                                            ]                }            ]        }    ]}