{    "limbs": [        {            "id": 2048831330,            "type": "node",            "label": "Bone Based",            "url": "bone_based",            "limbs": [                {                    "id": 2048836866,                    "type": "limb",                    "label": "3 Part Bone with Foot",                    "url": "3PartBonewithFoot.json",                    "img": "3PartBonewithFoot.png",                    "description": "This is the same as Bone with Foot except that the three sections of the limb are all generated as totally separate paths in the limb layer.\r\rThe three stroke colors have not been linked to the Upper, Middle and Lower color of the Limber effect (but they could be).\r\rIf you don’t want the foot, simply delete the Foot Group from the limb layer."                },                {                    "id": 2048837136,                    "type": "limb",                    "label": "Bone for adding strokes",                    "url": "Boneforaddingstrokes.json",                    "img": "Boneforaddingstrokes.png",                    "description": "This Bone adds a second Group with a copy of the base Path, a Trim Paths and another Stroke. Nothing is linked with any expressions except the Path. You can then duplicate this group and change each copy, as many times as you need to, to add extra strokes and colors in a straightforward way."                },                {                    "id": 2048837117,                    "type": "limb",                    "label": "Bone with End Rounding",                    "url": "BonewithEndRounding.json",                    "img": "BonewithEndRounding.png",                    "description": "This Bone adds rounding to the very start and end of the stroke - otherwise it’s just a standard Bone. Use the Upper and Lower Rounding properties in the Limber effect (the Upper and Lower Split properties have no effect)."                },                {                    "id": 1160,                    "type": "limb",                    "label": "Bone with Foot",                    "url": "BonewithFoot.json",                    "img": "BonewithFoot.png",                    "description": "This limb adds a fourth point to the end of the bone path as a foot, with controls for length, and the angles of the foot’s tangents. Those controls can be used to simulate  toe and heel roll as demonstrated here."                },                {                    "id": 2048834564,                    "type": "limb",                    "label": "Colored Bone",                    "url": "ColoredBone.json",                    "img": "ColoredBone.png",                    "description": "This limb replicates the color controls of a Taper limb, in a bone. You can set three colors, alter the point at which they split, and the rounding of those splits, all using the standard properties in the Limber effect.\r\rBut unlike Tapers, you can still use Bone Curvature to round out the joint, and everything is based on stroked paths instead of filled shapes.\r\rUse the Middle Size to control the stroke width."                },                {                    "id": 2048833911,                    "type": "limb",                    "label": "Faux 3D Bone",                    "url": "Faux3DBone.json",                    "img": "Faux3DBone.png",                    "description": "This Bone adds a Faux 3D look using two strokes with Trim Paths.\r\rIt uses the Start and End Sizes, Colors, Lower Split and Lower Rounding properties in the Limber effect.\r\rThis limb only works as expected when the End Size is smaller than the Start Size."                },                {                    "id": 2048830741,                    "type": "limb",                    "label": "Faux 3D Sleeve",                    "url": "Faux3DSleeve.json",                    "img": "Faux3DSleeve.png",                    "description": "This is based on Faux 3D Bone but has an open appearance to the sleeve end."                },                {                    "id": 2048830762,                    "type": "limb",                    "label": "Offset Bone",                    "url": "OffsetBone.json",                    "img": "OffsetBone.png",                    "description": "This limb is designed for cases where you want to offset a bone path on one side only, eg. for a stripe on one side of a leg.\r\rThere are controls on the limb layer for the amount of offset and subdivision (smoothness) of the path. It gets more CPU-intensive as you increase the subdivision.  You may want to reduce the subdivision until you come to render.\r\rTip: if you don’t want bendiness, try setting Bone Curvature to 0.1 and reduce the Offset Path Subdivision to 2."                },                {                    "id": 2048834843,                    "type": "limb",                    "label": "Outlined Bone",                    "url": "OutlinedBone.json",                    "img": "OutlinedBone.png",                    "description": "See controls on the limb layer for Stroke Color and Width. \r\rThis limb uses the Color and Split controls in the Limber effect, but ignores Rounding.\r\rThis limb only works as expected when the Sizes are smaller towards the end."                },                {                    "id": 2048834622,                    "type": "limb",                    "label": "Tapered Bone",                    "url": "TaperedBone.json",                    "img": "TaperedBone.png",                    "description": "After Effects v17.1 introduced native Tapered Strokes. This is one way to use them with Bones.\r\rThis limb uses the Color, Split and Rounding controls in the Limber effect.\r\rThis limb only works as expected when the Sizes are smaller towards the end."                }            ]        },        {            "id": 2048831329,            "type": "node",            "label": "Taper Based",            "url": "taper_based",            "limbs": [                {                    "id": 12,                    "type": "limb",                    "label": "Expanded Splits",                    "url": "ExpandedSplits.json",                    "img": "ExpandedSplits.png",                    "description": "See controls on the limb layer to change the expansion.\r\rThis limb may only work as expected when the Sizes are smaller towards the end."                },                {                    "id": 1205,                    "type": "limb",                    "label": "Foot with Toes",                    "url": "FootwithToes.json",                    "img": "FootwithToes.png",                    "description": "See controls on the limb layer to alter the foot."                },                {                    "id": 1220,                    "type": "limb",                    "label": "Hand",                    "url": "Hand.json",                    "img": "Hand.png",                    "description": "Alter the shapes inside the limb layer’s Hand Group to suit your needs. This group rotates as if it were parented to the End Controller eg. with the Rotate End property.\r\rUnlike Simple Foot, the hand group will not flip with the Clockwise property."                },                {                    "id": 2048835380,                    "type": "limb",                    "label": "Kurt Elbow Crease",                    "url": "KurtElbowCrease.json",                    "img": "KurtElbowCrease.png",                    "description": "This limb is designed to add a stroke to the limb with a crease in the inner joint. There are controls on the limb layer for the start and end angle that the crease occurs between, as well as the stroke color and weight.\r\rThe stroke on the lower split is turned off but can be re-enabled.  "                },                {                    "id": 2048836268,                    "type": "limb",                    "label": "Kurt Elbow Crease T shirt",                    "url": "KurtElbowCreaseTshirt.json",                    "img": "KurtElbowCreaseTshirt.png",                    "description": "This limb is based on Kurt’s Elbow Crease but adds a wider T-shirt style split in the upper limb. There are controls on the limb layer to adjust the sleeve size.\r\rUpper Rounding is ignored in this limb."                },                {                    "id": 1235,                    "type": "limb",                    "label": "Leg Muscles",                    "url": "LegMuscles.json",                    "img": "LegMuscles.png",                    "description": "This limb has controls on the limb layer to adjust the shape of the muscles.\r\rRounding is ignored in this limb."                },                {                    "id": 1281,                    "type": "limb",                    "label": "Muscles",                    "url": "Muscles.json",                    "img": "Muscles.png",                    "description": "This limb has controls on the limb layer to adjust the shape of the muscles.\r\rRounding is ignored in this limb."                },                {                    "id": 1373,                    "type": "limb",                    "label": "Pant",                    "url": "Pant.json",                    "img": "Pant.png",                    "description": "See controls on the limb layer to change the width and angle of the pant."                },                {                    "id": 1311,                    "type": "limb",                    "label": "Shorts and socks",                    "url": "Shortsandsocks.json",                    "img": "Shortsandsocks.png",                    "description": "This limb has controls on the limb layer to adjust the shape of the sleeve and position of the stripes.\r\rRounding is ignored in this limb."                },                {                    "id": 2048836680,                    "type": "limb",                    "label": "Simple Foot",                    "url": "SimpleFoot.json",                    "img": "SimpleFoot.png",                    "description": "A simple integrated foot. The foot rotates as if it were parented to the End Controller, eg. with the Rotate End property. It also flips left-to-right with the Clockwise property.\r\rSee controls on the limb layer to alter the foot."                },                {                    "id": 1,                    "type": "limb",                    "label": "Stroked Pant",                    "url": "StrokedPant.json",                    "img": "StrokedPant.png",                    "description": "A more advanced version of the Pant limb, with some specific extra features.\r\rSee various controls on the limb layer."                },                {                    "id": 1358,                    "type": "limb",                    "label": "T-shirt",                    "url": "T-shirt.json",                    "img": "T-shirt.png",                    "description": "This limb is similar to Shorts and socks. It has controls on the limb layer to adjust the shape of the sleeve and position of the tattoos. Color Splits control three colors all on the Upper limb - the lower limb has no split.\r\rRounding is ignored in this limb."                }            ]        },        {            "id": 2048831331,            "type": "node",            "label": "Unique",            "url": "unique",            "limbs": [                {                    "id": 2048837192,                    "type": "limb",                    "label": "Curved Bezier Taper",                    "url": "CurvedBezierTaper.json",                    "img": "CurvedBezierTaper.png",                    "description": "This limb adds automated curves to the taper shape.\r\rUse the Bone Curvature property to change the joint curve. If you want to control each side independently, uncheck the ‘Use Bone Curvature’ effect on the limb layer and adjust the Curvature Left and Right properties. "                },                {                    "id": 2048833696,                    "type": "limb",                    "label": "Curved Joint Taper",                    "url": "CurvedJointTaper.json",                    "img": "CurvedJointTaper.png",                    "description": "This limb adds an automated curve to the outer joint and a bone underneath the main filled shape.\r\rUse the Bone Curvature property to change the joint curve.\r\rChange the limb layer’s Contents > Bezier Taper > C3 Group > Rectangle > Size to alter how the ankle is cropped. "                },                {                    "id": 2048837208,                    "type": "limb",                    "label": "Half limb",                    "url": "Halflimb.json",                    "img": "Halflimb.png",                    "description": "This limb is intended for use as a matte - check out the Orphaned Limb Layers section of the User Guide to do so.\r\rSome properties such as Rounding and Colors are ignored in this limb. "                },                {                    "id": 2048837055,                    "type": "limb",                    "label": "Jim Outlined Arm",                    "url": "JimOutlinedArm.json",                    "img": "JimOutlinedArm.png",                    "description": "An effect on the limb layer controls the joint curvature. The Hand Group in this limb will always align to the limb, you cannot set it to not rotate. Alter or delete the hand group as required."                },                {                    "id": 1190,                    "type": "limb",                    "label": "Round Corners Taper",                    "url": "RoundCornersTaper.json",                    "img": "RoundCornersTaper.png",                    "description": "This limb is based on Square Elbow, but uses Round Corners to smooth the shape.\r\rIt responds to the Middle Color only, Upper and Lower Color are ignored.\r\rSee controls on the limb layer to change Rounding value. "                },                {                    "id": 1343,                    "type": "limb",                    "label": "Square Elbow",                    "url": "SquareElbow.json",                    "img": "SquareElbow.png",                    "description": "This limb adds a squared off joint.\r\rSee control on the limb layer for a Square Start control like the normal Square End.\r\rRounding is ignored in this limb."                },                {                    "id": 2048837224,                    "type": "limb",                    "label": "Swept Elbow",                    "url": "SweptElbow.json",                    "img": "SweptElbow.png",                    "description": "This limb adds automated curves to the taper shape.\r\rUse the Bone Curvature property to change the joint curve. If you want to control each side independently, uncheck the ‘Use Bone Curvature’ effect on the limb layer and adjust the Curvature Left and Right properties.\r\rThis limb responds to the Middle Color only, Upper and Lower Color are ignored."                }            ]        }    ]}